Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xfed (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xa73e6): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc87fe): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x8cbf1): D:/TRABAJO/UMAKER/CURSOS/ARM - NUCLEO/STM32_FromScratch/MARZO-2023/FreeRTOS/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x10621): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5caa3): long long int

    <5a>   DW_AT_encoding    : 8	(unsigned char)
    <5b>   DW_AT_name        : (indirect string, offset: 0xc3c99): unsigned char
 <1><5f>: Abbrev Number: 3 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0x96ff2): short int
 <1><66>: Abbrev Number: 4 (DW_TAG_typedef)
    <67>   DW_AT_name        : (indirect string, offset: 0xa57d8): __uint16_t
    <6b>   DW_AT_decl_file   : 3
    <6c>   DW_AT_decl_line   : 57
    <6d>   DW_AT_decl_column : 25
    <6e>   DW_AT_type        : <0x72>
 <1><72>: Abbrev Number: 3 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 2
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0xc244e): short unsigned int
 <1><79>: Abbrev Number: 3 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : (indirect string, offset: 0x10f4e): long int
 <1><80>: Abbrev Number: 4 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x8162b): __uint32_t
    <85>   DW_AT_decl_file   : 3
    <86>   DW_AT_decl_line   : 79
    <87>   DW_AT_decl_column : 25
    <88>   DW_AT_type        : <0x8c>
 <1><8c>: Abbrev Number: 3 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x4db19): long unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_base_type)
    <94>   DW_AT_byte_size   : 8
    <95>   DW_AT_encoding    : 7	(unsigned)
    <96>   DW_AT_name        : (indirect string, offset: 0x2a624): long long unsigned int
 <1><9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x3b0f2): uint8_t
    <9f>   DW_AT_decl_file   : 4
    <a0>   DW_AT_decl_line   : 24
    <a1>   DW_AT_decl_column : 19
    <a2>   DW_AT_type        : <0x4c>
 <1><a6>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a7>   DW_AT_type        : <0x9a>
 <1><ab>: Abbrev Number: 4 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (indirect string, offset: 0x93e24): uint16_t
    <b0>   DW_AT_decl_file   : 4
    <b1>   DW_AT_decl_line   : 36
    <b2>   DW_AT_decl_column : 20
    <b3>   DW_AT_type        : <0x66>
 <1><b7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b8>   DW_AT_type        : <0xab>
 <1><bc>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x9344e): uint32_t
    <c1>   DW_AT_decl_file   : 4
    <c2>   DW_AT_decl_line   : 48
    <c3>   DW_AT_decl_column : 20
    <c4>   DW_AT_type        : <0x80>
 <1><c8>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c9>   DW_AT_type        : <0xbc>
 <1><cd>: Abbrev Number: 6 (DW_TAG_const_type)
    <ce>   DW_AT_type        : <0xc8>
 <1><d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d3>   DW_AT_byte_size   : 4
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x6fd51): StackType_t
    <d9>   DW_AT_decl_file   : 5
    <da>   DW_AT_decl_line   : 55
    <db>   DW_AT_decl_column : 24
    <dc>   DW_AT_type        : <0xbc>
 <1><e0>: Abbrev Number: 4 (DW_TAG_typedef)
    <e1>   DW_AT_name        : (indirect string, offset: 0x15b6): UBaseType_t
    <e5>   DW_AT_decl_file   : 5
    <e6>   DW_AT_decl_line   : 57
    <e7>   DW_AT_decl_column : 23
    <e8>   DW_AT_type        : <0x8c>
 <1><ec>: Abbrev Number: 4 (DW_TAG_typedef)
    <ed>   DW_AT_name        : (indirect string, offset: 0x6fb60): TickType_t
    <f1>   DW_AT_decl_file   : 5
    <f2>   DW_AT_decl_line   : 63
    <f3>   DW_AT_decl_column : 19
    <f4>   DW_AT_type        : <0xbc>
 <1><f8>: Abbrev Number: 8 (DW_TAG_typedef)
    <f9>   DW_AT_name        : (indirect string, offset: 0x9534e): wint_t
    <fd>   DW_AT_decl_file   : 6
    <fe>   DW_AT_decl_line   : 350
    <100>   DW_AT_decl_column : 23
    <101>   DW_AT_type        : <0x30>
 <1><105>: Abbrev Number: 4 (DW_TAG_typedef)
    <106>   DW_AT_name        : (indirect string, offset: 0xcd2c0): _off_t
    <10a>   DW_AT_decl_file   : 7
    <10b>   DW_AT_decl_line   : 46
    <10c>   DW_AT_decl_column : 14
    <10d>   DW_AT_type        : <0x79>
 <1><111>: Abbrev Number: 4 (DW_TAG_typedef)
    <112>   DW_AT_name        : (indirect string, offset: 0x2d504): _fpos_t
    <116>   DW_AT_decl_file   : 7
    <117>   DW_AT_decl_line   : 116
    <118>   DW_AT_decl_column : 14
    <119>   DW_AT_type        : <0x79>
 <1><11d>: Abbrev Number: 9 (DW_TAG_union_type)
    <11e>   DW_AT_byte_size   : 4
    <11f>   DW_AT_decl_file   : 7
    <120>   DW_AT_decl_line   : 165
    <121>   DW_AT_decl_column : 3
    <122>   DW_AT_sibling     : <0x13f>
 <2><126>: Abbrev Number: 10 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0x9b1e8): __wch
    <12b>   DW_AT_decl_file   : 7
    <12c>   DW_AT_decl_line   : 167
    <12d>   DW_AT_decl_column : 12
    <12e>   DW_AT_type        : <0xf8>
 <2><132>: Abbrev Number: 10 (DW_TAG_member)
    <133>   DW_AT_name        : (indirect string, offset: 0x685a4): __wchb
    <137>   DW_AT_decl_file   : 7
    <138>   DW_AT_decl_line   : 168
    <139>   DW_AT_decl_column : 19
    <13a>   DW_AT_type        : <0x13f>
 <2><13e>: Abbrev Number: 0
 <1><13f>: Abbrev Number: 11 (DW_TAG_array_type)
    <140>   DW_AT_type        : <0x58>
    <144>   DW_AT_sibling     : <0x14f>
 <2><148>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <149>   DW_AT_type        : <0x30>
    <14d>   DW_AT_upper_bound : 3
 <2><14e>: Abbrev Number: 0
 <1><14f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <150>   DW_AT_byte_size   : 8
    <151>   DW_AT_decl_file   : 7
    <152>   DW_AT_decl_line   : 162
    <153>   DW_AT_decl_column : 9
    <154>   DW_AT_sibling     : <0x173>
 <2><158>: Abbrev Number: 14 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0x39210): __count
    <15d>   DW_AT_decl_file   : 7
    <15e>   DW_AT_decl_line   : 164
    <15f>   DW_AT_decl_column : 7
    <160>   DW_AT_type        : <0x29>
    <164>   DW_AT_data_member_location: 0
 <2><165>: Abbrev Number: 14 (DW_TAG_member)
    <166>   DW_AT_name        : (indirect string, offset: 0x741fa): __value
    <16a>   DW_AT_decl_file   : 7
    <16b>   DW_AT_decl_line   : 169
    <16c>   DW_AT_decl_column : 5
    <16d>   DW_AT_type        : <0x11d>
    <171>   DW_AT_data_member_location: 4
 <2><172>: Abbrev Number: 0
 <1><173>: Abbrev Number: 4 (DW_TAG_typedef)
    <174>   DW_AT_name        : (indirect string, offset: 0x6a17b): _mbstate_t
    <178>   DW_AT_decl_file   : 7
    <179>   DW_AT_decl_line   : 170
    <17a>   DW_AT_decl_column : 3
    <17b>   DW_AT_type        : <0x14f>
 <1><17f>: Abbrev Number: 4 (DW_TAG_typedef)
    <180>   DW_AT_name        : (indirect string, offset: 0x6de7a): __ULong
    <184>   DW_AT_decl_file   : 8
    <185>   DW_AT_decl_line   : 22
    <186>   DW_AT_decl_column : 25
    <187>   DW_AT_type        : <0x8c>
 <1><18b>: Abbrev Number: 4 (DW_TAG_typedef)
    <18c>   DW_AT_name        : (indirect string, offset: 0x6f565): _LOCK_T
    <190>   DW_AT_decl_file   : 9
    <191>   DW_AT_decl_line   : 34
    <192>   DW_AT_decl_column : 25
    <193>   DW_AT_type        : <0x197>
 <1><197>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <198>   DW_AT_byte_size   : 4
    <199>   DW_AT_type        : <0x19d>
 <1><19d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <19e>   DW_AT_name        : (indirect string, offset: 0x19b03): __lock
    <1a2>   DW_AT_declaration : 1
 <1><1a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <1a3>   DW_AT_name        : (indirect string, offset: 0x6400e): _flock_t
    <1a7>   DW_AT_decl_file   : 8
    <1a8>   DW_AT_decl_line   : 35
    <1a9>   DW_AT_decl_column : 27
    <1aa>   DW_AT_type        : <0x18b>
 <1><1ae>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1af>   DW_AT_name        : (indirect string, offset: 0x46d24): _Bigint
    <1b3>   DW_AT_byte_size   : 24
    <1b4>   DW_AT_decl_file   : 8
    <1b5>   DW_AT_decl_line   : 52
    <1b6>   DW_AT_decl_column : 8
    <1b7>   DW_AT_sibling     : <0x208>
 <2><1bb>: Abbrev Number: 14 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x79131): _next
    <1c0>   DW_AT_decl_file   : 8
    <1c1>   DW_AT_decl_line   : 54
    <1c2>   DW_AT_decl_column : 19
    <1c3>   DW_AT_type        : <0x208>
    <1c7>   DW_AT_data_member_location: 0
 <2><1c8>: Abbrev Number: 18 (DW_TAG_member)
    <1c9>   DW_AT_name        : _k
    <1cc>   DW_AT_decl_file   : 8
    <1cd>   DW_AT_decl_line   : 55
    <1ce>   DW_AT_decl_column : 7
    <1cf>   DW_AT_type        : <0x29>
    <1d3>   DW_AT_data_member_location: 4
 <2><1d4>: Abbrev Number: 14 (DW_TAG_member)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x91239): _maxwds
    <1d9>   DW_AT_decl_file   : 8
    <1da>   DW_AT_decl_line   : 55
    <1db>   DW_AT_decl_column : 11
    <1dc>   DW_AT_type        : <0x29>
    <1e0>   DW_AT_data_member_location: 8
 <2><1e1>: Abbrev Number: 14 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x6bf78): _sign
    <1e6>   DW_AT_decl_file   : 8
    <1e7>   DW_AT_decl_line   : 55
    <1e8>   DW_AT_decl_column : 20
    <1e9>   DW_AT_type        : <0x29>
    <1ed>   DW_AT_data_member_location: 12
 <2><1ee>: Abbrev Number: 14 (DW_TAG_member)
    <1ef>   DW_AT_name        : (indirect string, offset: 0x6b9e9): _wds
    <1f3>   DW_AT_decl_file   : 8
    <1f4>   DW_AT_decl_line   : 55
    <1f5>   DW_AT_decl_column : 27
    <1f6>   DW_AT_type        : <0x29>
    <1fa>   DW_AT_data_member_location: 16
 <2><1fb>: Abbrev Number: 18 (DW_TAG_member)
    <1fc>   DW_AT_name        : _x
    <1ff>   DW_AT_decl_file   : 8
    <200>   DW_AT_decl_line   : 56
    <201>   DW_AT_decl_column : 11
    <202>   DW_AT_type        : <0x20e>
    <206>   DW_AT_data_member_location: 20
 <2><207>: Abbrev Number: 0
 <1><208>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <209>   DW_AT_byte_size   : 4
    <20a>   DW_AT_type        : <0x1ae>
 <1><20e>: Abbrev Number: 11 (DW_TAG_array_type)
    <20f>   DW_AT_type        : <0x17f>
    <213>   DW_AT_sibling     : <0x21e>
 <2><217>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <218>   DW_AT_type        : <0x30>
    <21c>   DW_AT_upper_bound : 0
 <2><21d>: Abbrev Number: 0
 <1><21e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <21f>   DW_AT_name        : (indirect string, offset: 0x37886): __tm
    <223>   DW_AT_byte_size   : 36
    <224>   DW_AT_decl_file   : 8
    <225>   DW_AT_decl_line   : 60
    <226>   DW_AT_decl_column : 8
    <227>   DW_AT_sibling     : <0x2a1>
 <2><22b>: Abbrev Number: 14 (DW_TAG_member)
    <22c>   DW_AT_name        : (indirect string, offset: 0xa5e7c): __tm_sec
    <230>   DW_AT_decl_file   : 8
    <231>   DW_AT_decl_line   : 62
    <232>   DW_AT_decl_column : 9
    <233>   DW_AT_type        : <0x29>
    <237>   DW_AT_data_member_location: 0
 <2><238>: Abbrev Number: 14 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0xbe7): __tm_min
    <23d>   DW_AT_decl_file   : 8
    <23e>   DW_AT_decl_line   : 63
    <23f>   DW_AT_decl_column : 9
    <240>   DW_AT_type        : <0x29>
    <244>   DW_AT_data_member_location: 4
 <2><245>: Abbrev Number: 14 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x2b7f3): __tm_hour
    <24a>   DW_AT_decl_file   : 8
    <24b>   DW_AT_decl_line   : 64
    <24c>   DW_AT_decl_column : 9
    <24d>   DW_AT_type        : <0x29>
    <251>   DW_AT_data_member_location: 8
 <2><252>: Abbrev Number: 14 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x771f0): __tm_mday
    <257>   DW_AT_decl_file   : 8
    <258>   DW_AT_decl_line   : 65
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0x29>
    <25e>   DW_AT_data_member_location: 12
 <2><25f>: Abbrev Number: 14 (DW_TAG_member)
    <260>   DW_AT_name        : (indirect string, offset: 0x353b): __tm_mon
    <264>   DW_AT_decl_file   : 8
    <265>   DW_AT_decl_line   : 66
    <266>   DW_AT_decl_column : 9
    <267>   DW_AT_type        : <0x29>
    <26b>   DW_AT_data_member_location: 16
 <2><26c>: Abbrev Number: 14 (DW_TAG_member)
    <26d>   DW_AT_name        : (indirect string, offset: 0xbca0e): __tm_year
    <271>   DW_AT_decl_file   : 8
    <272>   DW_AT_decl_line   : 67
    <273>   DW_AT_decl_column : 9
    <274>   DW_AT_type        : <0x29>
    <278>   DW_AT_data_member_location: 20
 <2><279>: Abbrev Number: 14 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0x55bf3): __tm_wday
    <27e>   DW_AT_decl_file   : 8
    <27f>   DW_AT_decl_line   : 68
    <280>   DW_AT_decl_column : 9
    <281>   DW_AT_type        : <0x29>
    <285>   DW_AT_data_member_location: 24
 <2><286>: Abbrev Number: 14 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0xa05eb): __tm_yday
    <28b>   DW_AT_decl_file   : 8
    <28c>   DW_AT_decl_line   : 69
    <28d>   DW_AT_decl_column : 9
    <28e>   DW_AT_type        : <0x29>
    <292>   DW_AT_data_member_location: 28
 <2><293>: Abbrev Number: 14 (DW_TAG_member)
    <294>   DW_AT_name        : (indirect string, offset: 0xb670c): __tm_isdst
    <298>   DW_AT_decl_file   : 8
    <299>   DW_AT_decl_line   : 70
    <29a>   DW_AT_decl_column : 9
    <29b>   DW_AT_type        : <0x29>
    <29f>   DW_AT_data_member_location: 32
 <2><2a0>: Abbrev Number: 0
 <1><2a1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x878c3): __sbuf
    <2a6>   DW_AT_byte_size   : 8
    <2a7>   DW_AT_decl_file   : 8
    <2a8>   DW_AT_decl_line   : 122
    <2a9>   DW_AT_decl_column : 8
    <2aa>   DW_AT_sibling     : <0x2c9>
 <2><2ae>: Abbrev Number: 14 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0xc9c8c): _base
    <2b3>   DW_AT_decl_file   : 8
    <2b4>   DW_AT_decl_line   : 123
    <2b5>   DW_AT_decl_column : 17
    <2b6>   DW_AT_type        : <0x2c9>
    <2ba>   DW_AT_data_member_location: 0
 <2><2bb>: Abbrev Number: 14 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0xccddf): _size
    <2c0>   DW_AT_decl_file   : 8
    <2c1>   DW_AT_decl_line   : 124
    <2c2>   DW_AT_decl_column : 6
    <2c3>   DW_AT_type        : <0x29>
    <2c7>   DW_AT_data_member_location: 4
 <2><2c8>: Abbrev Number: 0
 <1><2c9>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <2ca>   DW_AT_byte_size   : 4
    <2cb>   DW_AT_type        : <0x58>
 <1><2cf>: Abbrev Number: 19 (DW_TAG_structure_type)
    <2d0>   DW_AT_name        : (indirect string, offset: 0xd1e35): _reent
    <2d4>   DW_AT_byte_size   : 96
    <2d5>   DW_AT_decl_file   : 8
    <2d6>   DW_AT_decl_line   : 377
    <2d8>   DW_AT_decl_column : 8
    <2d9>   DW_AT_sibling     : <0x412>
 <2><2dd>: Abbrev Number: 20 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0xccf70): _errno
    <2e2>   DW_AT_decl_file   : 8
    <2e3>   DW_AT_decl_line   : 381
    <2e5>   DW_AT_decl_column : 7
    <2e6>   DW_AT_type        : <0x29>
    <2ea>   DW_AT_data_member_location: 0
 <2><2eb>: Abbrev Number: 20 (DW_TAG_member)
    <2ec>   DW_AT_name        : (indirect string, offset: 0xd122f): _stdin
    <2f0>   DW_AT_decl_file   : 8
    <2f1>   DW_AT_decl_line   : 386
    <2f3>   DW_AT_decl_column : 11
    <2f4>   DW_AT_type        : <0x665>
    <2f8>   DW_AT_data_member_location: 4
 <2><2f9>: Abbrev Number: 20 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0xd1ce6): _stdout
    <2fe>   DW_AT_decl_file   : 8
    <2ff>   DW_AT_decl_line   : 386
    <301>   DW_AT_decl_column : 20
    <302>   DW_AT_type        : <0x665>
    <306>   DW_AT_data_member_location: 8
 <2><307>: Abbrev Number: 20 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0xd1c8f): _stderr
    <30c>   DW_AT_decl_file   : 8
    <30d>   DW_AT_decl_line   : 386
    <30f>   DW_AT_decl_column : 30
    <310>   DW_AT_type        : <0x665>
    <314>   DW_AT_data_member_location: 12
 <2><315>: Abbrev Number: 20 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0x80aae): _inc
    <31a>   DW_AT_decl_file   : 8
    <31b>   DW_AT_decl_line   : 388
    <31d>   DW_AT_decl_column : 8
    <31e>   DW_AT_type        : <0x29>
    <322>   DW_AT_data_member_location: 16
 <2><323>: Abbrev Number: 20 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x9ff99): _emergency
    <328>   DW_AT_decl_file   : 8
    <329>   DW_AT_decl_line   : 390
    <32b>   DW_AT_decl_column : 9
    <32c>   DW_AT_type        : <0x579>
    <330>   DW_AT_data_member_location: 20
 <2><331>: Abbrev Number: 20 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x57ed1): __sdidinit
    <336>   DW_AT_decl_file   : 8
    <337>   DW_AT_decl_line   : 392
    <339>   DW_AT_decl_column : 7
    <33a>   DW_AT_type        : <0x29>
    <33e>   DW_AT_data_member_location: 24
 <2><33f>: Abbrev Number: 20 (DW_TAG_member)
    <340>   DW_AT_name        : (indirect string, offset: 0x11f76): _unspecified_locale_info
    <344>   DW_AT_decl_file   : 8
    <345>   DW_AT_decl_line   : 394
    <347>   DW_AT_decl_column : 7
    <348>   DW_AT_type        : <0x29>
    <34c>   DW_AT_data_member_location: 28
 <2><34d>: Abbrev Number: 20 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0xb3ce0): _locale
    <352>   DW_AT_decl_file   : 8
    <353>   DW_AT_decl_line   : 395
    <355>   DW_AT_decl_column : 22
    <356>   DW_AT_type        : <0x7cd>
    <35a>   DW_AT_data_member_location: 32
 <2><35b>: Abbrev Number: 21 (DW_TAG_member)
    <35c>   DW_AT_name        : _mp
    <360>   DW_AT_decl_file   : 8
    <361>   DW_AT_decl_line   : 397
    <363>   DW_AT_decl_column : 18
    <364>   DW_AT_type        : <0x7d3>
    <368>   DW_AT_data_member_location: 36
 <2><369>: Abbrev Number: 20 (DW_TAG_member)
    <36a>   DW_AT_name        : (indirect string, offset: 0x1f325): __cleanup
    <36e>   DW_AT_decl_file   : 8
    <36f>   DW_AT_decl_line   : 399
    <371>   DW_AT_decl_column : 10
    <372>   DW_AT_type        : <0x7e4>
    <376>   DW_AT_data_member_location: 40
 <2><377>: Abbrev Number: 20 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x7d854): _gamma_signgam
    <37c>   DW_AT_decl_file   : 8
    <37d>   DW_AT_decl_line   : 401
    <37f>   DW_AT_decl_column : 7
    <380>   DW_AT_type        : <0x29>
    <384>   DW_AT_data_member_location: 44
 <2><385>: Abbrev Number: 20 (DW_TAG_member)
    <386>   DW_AT_name        : (indirect string, offset: 0x94f5f): _cvtlen
    <38a>   DW_AT_decl_file   : 8
    <38b>   DW_AT_decl_line   : 404
    <38d>   DW_AT_decl_column : 7
    <38e>   DW_AT_type        : <0x29>
    <392>   DW_AT_data_member_location: 48
 <2><393>: Abbrev Number: 20 (DW_TAG_member)
    <394>   DW_AT_name        : (indirect string, offset: 0x5ddcb): _cvtbuf
    <398>   DW_AT_decl_file   : 8
    <399>   DW_AT_decl_line   : 405
    <39b>   DW_AT_decl_column : 9
    <39c>   DW_AT_type        : <0x579>
    <3a0>   DW_AT_data_member_location: 52
 <2><3a1>: Abbrev Number: 20 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x97691): _r48
    <3a6>   DW_AT_decl_file   : 8
    <3a7>   DW_AT_decl_line   : 407
    <3a9>   DW_AT_decl_column : 19
    <3aa>   DW_AT_type        : <0x7ea>
    <3ae>   DW_AT_data_member_location: 56
 <2><3af>: Abbrev Number: 20 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0xa85f2): _localtime_buf
    <3b4>   DW_AT_decl_file   : 8
    <3b5>   DW_AT_decl_line   : 408
    <3b7>   DW_AT_decl_column : 16
    <3b8>   DW_AT_type        : <0x7f0>
    <3bc>   DW_AT_data_member_location: 60
 <2><3bd>: Abbrev Number: 20 (DW_TAG_member)
    <3be>   DW_AT_name        : (indirect string, offset: 0x30613): _asctime_buf
    <3c2>   DW_AT_decl_file   : 8
    <3c3>   DW_AT_decl_line   : 409
    <3c5>   DW_AT_decl_column : 9
    <3c6>   DW_AT_type        : <0x579>
    <3ca>   DW_AT_data_member_location: 64
 <2><3cb>: Abbrev Number: 20 (DW_TAG_member)
    <3cc>   DW_AT_name        : (indirect string, offset: 0xa63c8): _sig_func
    <3d0>   DW_AT_decl_file   : 8
    <3d1>   DW_AT_decl_line   : 412
    <3d3>   DW_AT_decl_column : 12
    <3d4>   DW_AT_type        : <0x801>
    <3d8>   DW_AT_data_member_location: 68
 <2><3d9>: Abbrev Number: 20 (DW_TAG_member)
    <3da>   DW_AT_name        : (indirect string, offset: 0x9101d): __sglue
    <3de>   DW_AT_decl_file   : 8
    <3df>   DW_AT_decl_line   : 420
    <3e1>   DW_AT_decl_column : 16
    <3e2>   DW_AT_type        : <0x626>
    <3e6>   DW_AT_data_member_location: 72
 <2><3e7>: Abbrev Number: 20 (DW_TAG_member)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x3701f): __sf
    <3ec>   DW_AT_decl_file   : 8
    <3ed>   DW_AT_decl_line   : 421
    <3ef>   DW_AT_decl_column : 11
    <3f0>   DW_AT_type        : <0x665>
    <3f4>   DW_AT_data_member_location: 84
 <2><3f5>: Abbrev Number: 20 (DW_TAG_member)
    <3f6>   DW_AT_name        : (indirect string, offset: 0x5b9c7): _misc
    <3fa>   DW_AT_decl_file   : 8
    <3fb>   DW_AT_decl_line   : 422
    <3fd>   DW_AT_decl_column : 23
    <3fe>   DW_AT_type        : <0x80d>
    <402>   DW_AT_data_member_location: 88
 <2><403>: Abbrev Number: 20 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0x7ebd4): _signal_buf
    <408>   DW_AT_decl_file   : 8
    <409>   DW_AT_decl_line   : 423
    <40b>   DW_AT_decl_column : 9
    <40c>   DW_AT_type        : <0x579>
    <410>   DW_AT_data_member_location: 92
 <2><411>: Abbrev Number: 0
 <1><412>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <413>   DW_AT_byte_size   : 4
    <414>   DW_AT_type        : <0x2cf>
 <1><418>: Abbrev Number: 17 (DW_TAG_structure_type)
    <419>   DW_AT_name        : (indirect string, offset: 0x9ae76): __sFILE
    <41d>   DW_AT_byte_size   : 104
    <41e>   DW_AT_decl_file   : 8
    <41f>   DW_AT_decl_line   : 186
    <420>   DW_AT_decl_column : 8
    <421>   DW_AT_sibling     : <0x55b>
 <2><425>: Abbrev Number: 18 (DW_TAG_member)
    <426>   DW_AT_name        : _p
    <429>   DW_AT_decl_file   : 8
    <42a>   DW_AT_decl_line   : 187
    <42b>   DW_AT_decl_column : 18
    <42c>   DW_AT_type        : <0x2c9>
    <430>   DW_AT_data_member_location: 0
 <2><431>: Abbrev Number: 18 (DW_TAG_member)
    <432>   DW_AT_name        : _r
    <435>   DW_AT_decl_file   : 8
    <436>   DW_AT_decl_line   : 188
    <437>   DW_AT_decl_column : 7
    <438>   DW_AT_type        : <0x29>
    <43c>   DW_AT_data_member_location: 4
 <2><43d>: Abbrev Number: 18 (DW_TAG_member)
    <43e>   DW_AT_name        : _w
    <441>   DW_AT_decl_file   : 8
    <442>   DW_AT_decl_line   : 189
    <443>   DW_AT_decl_column : 7
    <444>   DW_AT_type        : <0x29>
    <448>   DW_AT_data_member_location: 8
 <2><449>: Abbrev Number: 14 (DW_TAG_member)
    <44a>   DW_AT_name        : (indirect string, offset: 0x5cb68): _flags
    <44e>   DW_AT_decl_file   : 8
    <44f>   DW_AT_decl_line   : 190
    <450>   DW_AT_decl_column : 9
    <451>   DW_AT_type        : <0x5f>
    <455>   DW_AT_data_member_location: 12
 <2><456>: Abbrev Number: 14 (DW_TAG_member)
    <457>   DW_AT_name        : (indirect string, offset: 0x1e755): _file
    <45b>   DW_AT_decl_file   : 8
    <45c>   DW_AT_decl_line   : 191
    <45d>   DW_AT_decl_column : 9
    <45e>   DW_AT_type        : <0x5f>
    <462>   DW_AT_data_member_location: 14
 <2><463>: Abbrev Number: 18 (DW_TAG_member)
    <464>   DW_AT_name        : _bf
    <468>   DW_AT_decl_file   : 8
    <469>   DW_AT_decl_line   : 192
    <46a>   DW_AT_decl_column : 17
    <46b>   DW_AT_type        : <0x2a1>
    <46f>   DW_AT_data_member_location: 16
 <2><470>: Abbrev Number: 14 (DW_TAG_member)
    <471>   DW_AT_name        : (indirect string, offset: 0x5d1cb): _lbfsize
    <475>   DW_AT_decl_file   : 8
    <476>   DW_AT_decl_line   : 193
    <477>   DW_AT_decl_column : 7
    <478>   DW_AT_type        : <0x29>
    <47c>   DW_AT_data_member_location: 24
 <2><47d>: Abbrev Number: 14 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0x8e552): _data
    <482>   DW_AT_decl_file   : 8
    <483>   DW_AT_decl_line   : 196
    <484>   DW_AT_decl_column : 18
    <485>   DW_AT_type        : <0x412>
    <489>   DW_AT_data_member_location: 28
 <2><48a>: Abbrev Number: 14 (DW_TAG_member)
    <48b>   DW_AT_name        : (indirect string, offset: 0x35eea): _cookie
    <48f>   DW_AT_decl_file   : 8
    <490>   DW_AT_decl_line   : 200
    <491>   DW_AT_decl_column : 10
    <492>   DW_AT_type        : <0xd2>
    <496>   DW_AT_data_member_location: 32
 <2><497>: Abbrev Number: 14 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x9fc5e): _read
    <49c>   DW_AT_decl_file   : 8
    <49d>   DW_AT_decl_line   : 202
    <49e>   DW_AT_decl_column : 29
    <49f>   DW_AT_type        : <0x58b>
    <4a3>   DW_AT_data_member_location: 36
 <2><4a4>: Abbrev Number: 14 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x19b1c): _write
    <4a9>   DW_AT_decl_file   : 8
    <4aa>   DW_AT_decl_line   : 204
    <4ab>   DW_AT_decl_column : 29
    <4ac>   DW_AT_type        : <0x5b5>
    <4b0>   DW_AT_data_member_location: 40
 <2><4b1>: Abbrev Number: 14 (DW_TAG_member)
    <4b2>   DW_AT_name        : (indirect string, offset: 0xc7456): _seek
    <4b6>   DW_AT_decl_file   : 8
    <4b7>   DW_AT_decl_line   : 207
    <4b8>   DW_AT_decl_column : 13
    <4b9>   DW_AT_type        : <0x5d9>
    <4bd>   DW_AT_data_member_location: 44
 <2><4be>: Abbrev Number: 14 (DW_TAG_member)
    <4bf>   DW_AT_name        : (indirect string, offset: 0x590f2): _close
    <4c3>   DW_AT_decl_file   : 8
    <4c4>   DW_AT_decl_line   : 208
    <4c5>   DW_AT_decl_column : 9
    <4c6>   DW_AT_type        : <0x5f3>
    <4ca>   DW_AT_data_member_location: 48
 <2><4cb>: Abbrev Number: 18 (DW_TAG_member)
    <4cc>   DW_AT_name        : _ub
    <4d0>   DW_AT_decl_file   : 8
    <4d1>   DW_AT_decl_line   : 211
    <4d2>   DW_AT_decl_column : 17
    <4d3>   DW_AT_type        : <0x2a1>
    <4d7>   DW_AT_data_member_location: 52
 <2><4d8>: Abbrev Number: 18 (DW_TAG_member)
    <4d9>   DW_AT_name        : _up
    <4dd>   DW_AT_decl_file   : 8
    <4de>   DW_AT_decl_line   : 212
    <4df>   DW_AT_decl_column : 18
    <4e0>   DW_AT_type        : <0x2c9>
    <4e4>   DW_AT_data_member_location: 60
 <2><4e5>: Abbrev Number: 18 (DW_TAG_member)
    <4e6>   DW_AT_name        : _ur
    <4ea>   DW_AT_decl_file   : 8
    <4eb>   DW_AT_decl_line   : 213
    <4ec>   DW_AT_decl_column : 7
    <4ed>   DW_AT_type        : <0x29>
    <4f1>   DW_AT_data_member_location: 64
 <2><4f2>: Abbrev Number: 14 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0xc4e6c): _ubuf
    <4f7>   DW_AT_decl_file   : 8
    <4f8>   DW_AT_decl_line   : 216
    <4f9>   DW_AT_decl_column : 17
    <4fa>   DW_AT_type        : <0x5f9>
    <4fe>   DW_AT_data_member_location: 68
 <2><4ff>: Abbrev Number: 14 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0x89d63): _nbuf
    <504>   DW_AT_decl_file   : 8
    <505>   DW_AT_decl_line   : 217
    <506>   DW_AT_decl_column : 17
    <507>   DW_AT_type        : <0x609>
    <50b>   DW_AT_data_member_location: 71
 <2><50c>: Abbrev Number: 18 (DW_TAG_member)
    <50d>   DW_AT_name        : _lb
    <511>   DW_AT_decl_file   : 8
    <512>   DW_AT_decl_line   : 220
    <513>   DW_AT_decl_column : 17
    <514>   DW_AT_type        : <0x2a1>
    <518>   DW_AT_data_member_location: 72
 <2><519>: Abbrev Number: 14 (DW_TAG_member)
    <51a>   DW_AT_name        : (indirect string, offset: 0xcca97): _blksize
    <51e>   DW_AT_decl_file   : 8
    <51f>   DW_AT_decl_line   : 223
    <520>   DW_AT_decl_column : 7
    <521>   DW_AT_type        : <0x29>
    <525>   DW_AT_data_member_location: 80
 <2><526>: Abbrev Number: 14 (DW_TAG_member)
    <527>   DW_AT_name        : (indirect string, offset: 0x41916): _offset
    <52b>   DW_AT_decl_file   : 8
    <52c>   DW_AT_decl_line   : 224
    <52d>   DW_AT_decl_column : 10
    <52e>   DW_AT_type        : <0x105>
    <532>   DW_AT_data_member_location: 84
 <2><533>: Abbrev Number: 14 (DW_TAG_member)
    <534>   DW_AT_name        : (indirect string, offset: 0x19b04): _lock
    <538>   DW_AT_decl_file   : 8
    <539>   DW_AT_decl_line   : 231
    <53a>   DW_AT_decl_column : 12
    <53b>   DW_AT_type        : <0x1a2>
    <53f>   DW_AT_data_member_location: 88
 <2><540>: Abbrev Number: 14 (DW_TAG_member)
    <541>   DW_AT_name        : (indirect string, offset: 0x58899): _mbstate
    <545>   DW_AT_decl_file   : 8
    <546>   DW_AT_decl_line   : 233
    <547>   DW_AT_decl_column : 14
    <548>   DW_AT_type        : <0x173>
    <54c>   DW_AT_data_member_location: 92
 <2><54d>: Abbrev Number: 14 (DW_TAG_member)
    <54e>   DW_AT_name        : (indirect string, offset: 0xa4c80): _flags2
    <552>   DW_AT_decl_file   : 8
    <553>   DW_AT_decl_line   : 234
    <554>   DW_AT_decl_column : 9
    <555>   DW_AT_type        : <0x29>
    <559>   DW_AT_data_member_location: 100
 <2><55a>: Abbrev Number: 0
 <1><55b>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <55c>   DW_AT_prototyped  : 1
    <55c>   DW_AT_type        : <0x29>
    <560>   DW_AT_sibling     : <0x579>
 <2><564>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <565>   DW_AT_type        : <0x412>
 <2><569>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <56a>   DW_AT_type        : <0xd2>
 <2><56e>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <56f>   DW_AT_type        : <0x579>
 <2><573>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <574>   DW_AT_type        : <0x29>
 <2><578>: Abbrev Number: 0
 <1><579>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <57a>   DW_AT_byte_size   : 4
    <57b>   DW_AT_type        : <0x57f>
 <1><57f>: Abbrev Number: 3 (DW_TAG_base_type)
    <580>   DW_AT_byte_size   : 1
    <581>   DW_AT_encoding    : 8	(unsigned char)
    <582>   DW_AT_name        : (indirect string, offset: 0x41d1c): char
 <1><586>: Abbrev Number: 6 (DW_TAG_const_type)
    <587>   DW_AT_type        : <0x57f>
 <1><58b>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <58c>   DW_AT_byte_size   : 4
    <58d>   DW_AT_type        : <0x55b>
 <1><591>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <592>   DW_AT_prototyped  : 1
    <592>   DW_AT_type        : <0x29>
    <596>   DW_AT_sibling     : <0x5af>
 <2><59a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <59b>   DW_AT_type        : <0x412>
 <2><59f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5a0>   DW_AT_type        : <0xd2>
 <2><5a4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5a5>   DW_AT_type        : <0x5af>
 <2><5a9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5aa>   DW_AT_type        : <0x29>
 <2><5ae>: Abbrev Number: 0
 <1><5af>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5b0>   DW_AT_byte_size   : 4
    <5b1>   DW_AT_type        : <0x586>
 <1><5b5>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5b6>   DW_AT_byte_size   : 4
    <5b7>   DW_AT_type        : <0x591>
 <1><5bb>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <5bc>   DW_AT_prototyped  : 1
    <5bc>   DW_AT_type        : <0x111>
    <5c0>   DW_AT_sibling     : <0x5d9>
 <2><5c4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5c5>   DW_AT_type        : <0x412>
 <2><5c9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5ca>   DW_AT_type        : <0xd2>
 <2><5ce>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5cf>   DW_AT_type        : <0x111>
 <2><5d3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5d4>   DW_AT_type        : <0x29>
 <2><5d8>: Abbrev Number: 0
 <1><5d9>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5da>   DW_AT_byte_size   : 4
    <5db>   DW_AT_type        : <0x5bb>
 <1><5df>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <5e0>   DW_AT_prototyped  : 1
    <5e0>   DW_AT_type        : <0x29>
    <5e4>   DW_AT_sibling     : <0x5f3>
 <2><5e8>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5e9>   DW_AT_type        : <0x412>
 <2><5ed>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5ee>   DW_AT_type        : <0xd2>
 <2><5f2>: Abbrev Number: 0
 <1><5f3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5f4>   DW_AT_byte_size   : 4
    <5f5>   DW_AT_type        : <0x5df>
 <1><5f9>: Abbrev Number: 11 (DW_TAG_array_type)
    <5fa>   DW_AT_type        : <0x58>
    <5fe>   DW_AT_sibling     : <0x609>
 <2><602>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <603>   DW_AT_type        : <0x30>
    <607>   DW_AT_upper_bound : 2
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 11 (DW_TAG_array_type)
    <60a>   DW_AT_type        : <0x58>
    <60e>   DW_AT_sibling     : <0x619>
 <2><612>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <613>   DW_AT_type        : <0x30>
    <617>   DW_AT_upper_bound : 0
 <2><618>: Abbrev Number: 0
 <1><619>: Abbrev Number: 8 (DW_TAG_typedef)
    <61a>   DW_AT_name        : (indirect string, offset: 0xa224d): __FILE
    <61e>   DW_AT_decl_file   : 8
    <61f>   DW_AT_decl_line   : 292
    <621>   DW_AT_decl_column : 26
    <622>   DW_AT_type        : <0x418>
 <1><626>: Abbrev Number: 19 (DW_TAG_structure_type)
    <627>   DW_AT_name        : (indirect string, offset: 0xad9b0): _glue
    <62b>   DW_AT_byte_size   : 12
    <62c>   DW_AT_decl_file   : 8
    <62d>   DW_AT_decl_line   : 296
    <62f>   DW_AT_decl_column : 8
    <630>   DW_AT_sibling     : <0x65f>
 <2><634>: Abbrev Number: 20 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x79131): _next
    <639>   DW_AT_decl_file   : 8
    <63a>   DW_AT_decl_line   : 298
    <63c>   DW_AT_decl_column : 17
    <63d>   DW_AT_type        : <0x65f>
    <641>   DW_AT_data_member_location: 0
 <2><642>: Abbrev Number: 20 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0x4c5e9): _niobs
    <647>   DW_AT_decl_file   : 8
    <648>   DW_AT_decl_line   : 299
    <64a>   DW_AT_decl_column : 7
    <64b>   DW_AT_type        : <0x29>
    <64f>   DW_AT_data_member_location: 4
 <2><650>: Abbrev Number: 20 (DW_TAG_member)
    <651>   DW_AT_name        : (indirect string, offset: 0x66740): _iobs
    <655>   DW_AT_decl_file   : 8
    <656>   DW_AT_decl_line   : 300
    <658>   DW_AT_decl_column : 11
    <659>   DW_AT_type        : <0x665>
    <65d>   DW_AT_data_member_location: 8
 <2><65e>: Abbrev Number: 0
 <1><65f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <660>   DW_AT_byte_size   : 4
    <661>   DW_AT_type        : <0x626>
 <1><665>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <666>   DW_AT_byte_size   : 4
    <667>   DW_AT_type        : <0x619>
 <1><66b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <66c>   DW_AT_name        : (indirect string, offset: 0x469cd): _rand48
    <670>   DW_AT_byte_size   : 24
    <671>   DW_AT_decl_file   : 8
    <672>   DW_AT_decl_line   : 324
    <674>   DW_AT_decl_column : 8
    <675>   DW_AT_sibling     : <0x6b2>
 <2><679>: Abbrev Number: 20 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0xc73d5): _seed
    <67e>   DW_AT_decl_file   : 8
    <67f>   DW_AT_decl_line   : 325
    <681>   DW_AT_decl_column : 18
    <682>   DW_AT_type        : <0x6b2>
    <686>   DW_AT_data_member_location: 0
 <2><687>: Abbrev Number: 20 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0x10bfe): _mult
    <68c>   DW_AT_decl_file   : 8
    <68d>   DW_AT_decl_line   : 326
    <68f>   DW_AT_decl_column : 18
    <690>   DW_AT_type        : <0x6b2>
    <694>   DW_AT_data_member_location: 6
 <2><695>: Abbrev Number: 20 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0x68653): _add
    <69a>   DW_AT_decl_file   : 8
    <69b>   DW_AT_decl_line   : 327
    <69d>   DW_AT_decl_column : 18
    <69e>   DW_AT_type        : <0x72>
    <6a2>   DW_AT_data_member_location: 12
 <2><6a3>: Abbrev Number: 20 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x7912c): _rand_next
    <6a8>   DW_AT_decl_file   : 8
    <6a9>   DW_AT_decl_line   : 330
    <6ab>   DW_AT_decl_column : 36
    <6ac>   DW_AT_type        : <0x93>
    <6b0>   DW_AT_data_member_location: 16
 <2><6b1>: Abbrev Number: 0
 <1><6b2>: Abbrev Number: 11 (DW_TAG_array_type)
    <6b3>   DW_AT_type        : <0x72>
    <6b7>   DW_AT_sibling     : <0x6c2>
 <2><6bb>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <6bc>   DW_AT_type        : <0x30>
    <6c0>   DW_AT_upper_bound : 2
 <2><6c1>: Abbrev Number: 0
 <1><6c2>: Abbrev Number: 19 (DW_TAG_structure_type)
    <6c3>   DW_AT_name        : (indirect string, offset: 0x9a27a): _mprec
    <6c7>   DW_AT_byte_size   : 16
    <6c8>   DW_AT_decl_file   : 8
    <6c9>   DW_AT_decl_line   : 349
    <6cb>   DW_AT_decl_column : 8
    <6cc>   DW_AT_sibling     : <0x709>
 <2><6d0>: Abbrev Number: 20 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xca8e1): _result
    <6d5>   DW_AT_decl_file   : 8
    <6d6>   DW_AT_decl_line   : 352
    <6d8>   DW_AT_decl_column : 19
    <6d9>   DW_AT_type        : <0x208>
    <6dd>   DW_AT_data_member_location: 0
 <2><6de>: Abbrev Number: 20 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0x7ebf9): _result_k
    <6e3>   DW_AT_decl_file   : 8
    <6e4>   DW_AT_decl_line   : 353
    <6e6>   DW_AT_decl_column : 7
    <6e7>   DW_AT_type        : <0x29>
    <6eb>   DW_AT_data_member_location: 4
 <2><6ec>: Abbrev Number: 20 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x608e6): _p5s
    <6f1>   DW_AT_decl_file   : 8
    <6f2>   DW_AT_decl_line   : 354
    <6f4>   DW_AT_decl_column : 19
    <6f5>   DW_AT_type        : <0x208>
    <6f9>   DW_AT_data_member_location: 8
 <2><6fa>: Abbrev Number: 20 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x75410): _freelist
    <6ff>   DW_AT_decl_file   : 8
    <700>   DW_AT_decl_line   : 355
    <702>   DW_AT_decl_column : 20
    <703>   DW_AT_type        : <0x709>
    <707>   DW_AT_data_member_location: 12
 <2><708>: Abbrev Number: 0
 <1><709>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <70a>   DW_AT_byte_size   : 4
    <70b>   DW_AT_type        : <0x208>
 <1><70f>: Abbrev Number: 19 (DW_TAG_structure_type)
    <710>   DW_AT_name        : (indirect string, offset: 0x6088a): _misc_reent
    <714>   DW_AT_byte_size   : 80
    <715>   DW_AT_decl_file   : 8
    <716>   DW_AT_decl_line   : 359
    <718>   DW_AT_decl_column : 8
    <719>   DW_AT_sibling     : <0x7b8>
 <2><71d>: Abbrev Number: 20 (DW_TAG_member)
    <71e>   DW_AT_name        : (indirect string, offset: 0xb9461): _strtok_last
    <722>   DW_AT_decl_file   : 8
    <723>   DW_AT_decl_line   : 362
    <725>   DW_AT_decl_column : 9
    <726>   DW_AT_type        : <0x579>
    <72a>   DW_AT_data_member_location: 0
 <2><72b>: Abbrev Number: 20 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0x5862a): _mblen_state
    <730>   DW_AT_decl_file   : 8
    <731>   DW_AT_decl_line   : 363
    <733>   DW_AT_decl_column : 14
    <734>   DW_AT_type        : <0x173>
    <738>   DW_AT_data_member_location: 4
 <2><739>: Abbrev Number: 20 (DW_TAG_member)
    <73a>   DW_AT_name        : (indirect string, offset: 0xb9490): _wctomb_state
    <73e>   DW_AT_decl_file   : 8
    <73f>   DW_AT_decl_line   : 364
    <741>   DW_AT_decl_column : 14
    <742>   DW_AT_type        : <0x173>
    <746>   DW_AT_data_member_location: 12
 <2><747>: Abbrev Number: 20 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0xacc2d): _mbtowc_state
    <74c>   DW_AT_decl_file   : 8
    <74d>   DW_AT_decl_line   : 365
    <74f>   DW_AT_decl_column : 14
    <750>   DW_AT_type        : <0x173>
    <754>   DW_AT_data_member_location: 20
 <2><755>: Abbrev Number: 20 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0xb2cee): _l64a_buf
    <75a>   DW_AT_decl_file   : 8
    <75b>   DW_AT_decl_line   : 366
    <75d>   DW_AT_decl_column : 8
    <75e>   DW_AT_type        : <0x7b8>
    <762>   DW_AT_data_member_location: 28
 <2><763>: Abbrev Number: 20 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0xb7fc2): _getdate_err
    <768>   DW_AT_decl_file   : 8
    <769>   DW_AT_decl_line   : 367
    <76b>   DW_AT_decl_column : 7
    <76c>   DW_AT_type        : <0x29>
    <770>   DW_AT_data_member_location: 36
 <2><771>: Abbrev Number: 20 (DW_TAG_member)
    <772>   DW_AT_name        : (indirect string, offset: 0x61d24): _mbrlen_state
    <776>   DW_AT_decl_file   : 8
    <777>   DW_AT_decl_line   : 368
    <779>   DW_AT_decl_column : 14
    <77a>   DW_AT_type        : <0x173>
    <77e>   DW_AT_data_member_location: 40
 <2><77f>: Abbrev Number: 20 (DW_TAG_member)
    <780>   DW_AT_name        : (indirect string, offset: 0xb84cb): _mbrtowc_state
    <784>   DW_AT_decl_file   : 8
    <785>   DW_AT_decl_line   : 369
    <787>   DW_AT_decl_column : 14
    <788>   DW_AT_type        : <0x173>
    <78c>   DW_AT_data_member_location: 48
 <2><78d>: Abbrev Number: 20 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0x39560): _mbsrtowcs_state
    <792>   DW_AT_decl_file   : 8
    <793>   DW_AT_decl_line   : 370
    <795>   DW_AT_decl_column : 14
    <796>   DW_AT_type        : <0x173>
    <79a>   DW_AT_data_member_location: 56
 <2><79b>: Abbrev Number: 20 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x3ed4c): _wcrtomb_state
    <7a0>   DW_AT_decl_file   : 8
    <7a1>   DW_AT_decl_line   : 371
    <7a3>   DW_AT_decl_column : 14
    <7a4>   DW_AT_type        : <0x173>
    <7a8>   DW_AT_data_member_location: 64
 <2><7a9>: Abbrev Number: 20 (DW_TAG_member)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x730ee): _wcsrtombs_state
    <7ae>   DW_AT_decl_file   : 8
    <7af>   DW_AT_decl_line   : 372
    <7b1>   DW_AT_decl_column : 14
    <7b2>   DW_AT_type        : <0x173>
    <7b6>   DW_AT_data_member_location: 72
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 11 (DW_TAG_array_type)
    <7b9>   DW_AT_type        : <0x57f>
    <7bd>   DW_AT_sibling     : <0x7c8>
 <2><7c1>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <7c2>   DW_AT_type        : <0x30>
    <7c6>   DW_AT_upper_bound : 7
 <2><7c7>: Abbrev Number: 0
 <1><7c8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <7c9>   DW_AT_name        : (indirect string, offset: 0xad9f6): __locale_t
    <7cd>   DW_AT_declaration : 1
 <1><7cd>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <7ce>   DW_AT_byte_size   : 4
    <7cf>   DW_AT_type        : <0x7c8>
 <1><7d3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <7d4>   DW_AT_byte_size   : 4
    <7d5>   DW_AT_type        : <0x6c2>
 <1><7d9>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <7da>   DW_AT_prototyped  : 1
    <7da>   DW_AT_sibling     : <0x7e4>
 <2><7de>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <7df>   DW_AT_type        : <0x412>
 <2><7e3>: Abbrev Number: 0
 <1><7e4>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <7e5>   DW_AT_byte_size   : 4
    <7e6>   DW_AT_type        : <0x7d9>
 <1><7ea>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <7eb>   DW_AT_byte_size   : 4
    <7ec>   DW_AT_type        : <0x66b>
 <1><7f0>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <7f1>   DW_AT_byte_size   : 4
    <7f2>   DW_AT_type        : <0x21e>
 <1><7f6>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <7f7>   DW_AT_prototyped  : 1
    <7f7>   DW_AT_sibling     : <0x801>
 <2><7fb>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <7fc>   DW_AT_type        : <0x29>
 <2><800>: Abbrev Number: 0
 <1><801>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <802>   DW_AT_byte_size   : 4
    <803>   DW_AT_type        : <0x807>
 <1><807>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <808>   DW_AT_byte_size   : 4
    <809>   DW_AT_type        : <0x7f6>
 <1><80d>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <80e>   DW_AT_byte_size   : 4
    <80f>   DW_AT_type        : <0x70f>
 <1><813>: Abbrev Number: 19 (DW_TAG_structure_type)
    <814>   DW_AT_name        : (indirect string, offset: 0xa9629): xSTATIC_LIST_ITEM
    <818>   DW_AT_byte_size   : 20
    <819>   DW_AT_decl_file   : 10
    <81a>   DW_AT_decl_line   : 1061
    <81c>   DW_AT_decl_column : 8
    <81d>   DW_AT_sibling     : <0x83e>
 <2><821>: Abbrev Number: 20 (DW_TAG_member)
    <822>   DW_AT_name        : (indirect string, offset: 0xd0361): xDummy2
    <826>   DW_AT_decl_file   : 10
    <827>   DW_AT_decl_line   : 1066
    <829>   DW_AT_decl_column : 13
    <82a>   DW_AT_type        : <0xec>
    <82e>   DW_AT_data_member_location: 0
 <2><82f>: Abbrev Number: 20 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x49401): pvDummy3
    <834>   DW_AT_decl_file   : 10
    <835>   DW_AT_decl_line   : 1067
    <837>   DW_AT_decl_column : 8
    <838>   DW_AT_type        : <0x83e>
    <83c>   DW_AT_data_member_location: 4
 <2><83d>: Abbrev Number: 0
 <1><83e>: Abbrev Number: 11 (DW_TAG_array_type)
    <83f>   DW_AT_type        : <0xd2>
    <843>   DW_AT_sibling     : <0x84e>
 <2><847>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <848>   DW_AT_type        : <0x30>
    <84c>   DW_AT_upper_bound : 3
 <2><84d>: Abbrev Number: 0
 <1><84e>: Abbrev Number: 8 (DW_TAG_typedef)
    <84f>   DW_AT_name        : (indirect string, offset: 0x99399): StaticListItem_t
    <853>   DW_AT_decl_file   : 10
    <854>   DW_AT_decl_line   : 1072
    <856>   DW_AT_decl_column : 34
    <857>   DW_AT_type        : <0x813>
 <1><85b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <85c>   DW_AT_name        : (indirect string, offset: 0x73f01): xSTATIC_TCB
    <860>   DW_AT_byte_size   : 180
    <861>   DW_AT_decl_file   : 10
    <862>   DW_AT_decl_line   : 1112
    <864>   DW_AT_decl_column : 16
    <865>   DW_AT_sibling     : <0x8f6>
 <2><869>: Abbrev Number: 20 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0x294e4): pxDummy1
    <86e>   DW_AT_decl_file   : 10
    <86f>   DW_AT_decl_line   : 1114
    <871>   DW_AT_decl_column : 11
    <872>   DW_AT_type        : <0xd2>
    <876>   DW_AT_data_member_location: 0
 <2><877>: Abbrev Number: 20 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0x26a33): xDummy3
    <87c>   DW_AT_decl_file   : 10
    <87d>   DW_AT_decl_line   : 1118
    <87f>   DW_AT_decl_column : 19
    <880>   DW_AT_type        : <0x8f6>
    <884>   DW_AT_data_member_location: 4
 <2><885>: Abbrev Number: 20 (DW_TAG_member)
    <886>   DW_AT_name        : (indirect string, offset: 0x1bd37): uxDummy5
    <88a>   DW_AT_decl_file   : 10
    <88b>   DW_AT_decl_line   : 1119
    <88d>   DW_AT_decl_column : 16
    <88e>   DW_AT_type        : <0xe0>
    <892>   DW_AT_data_member_location: 44
 <2><893>: Abbrev Number: 20 (DW_TAG_member)
    <894>   DW_AT_name        : (indirect string, offset: 0x29527): pxDummy6
    <898>   DW_AT_decl_file   : 10
    <899>   DW_AT_decl_line   : 1120
    <89b>   DW_AT_decl_column : 11
    <89c>   DW_AT_type        : <0xd2>
    <8a0>   DW_AT_data_member_location: 48
 <2><8a1>: Abbrev Number: 20 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x47eed): ucDummy7
    <8a6>   DW_AT_decl_file   : 10
    <8a7>   DW_AT_decl_line   : 1121
    <8a9>   DW_AT_decl_column : 13
    <8aa>   DW_AT_type        : <0x906>
    <8ae>   DW_AT_data_member_location: 52
 <2><8af>: Abbrev Number: 20 (DW_TAG_member)
    <8b0>   DW_AT_name        : (indirect string, offset: 0x2d00f): uxDummy12
    <8b4>   DW_AT_decl_file   : 10
    <8b5>   DW_AT_decl_line   : 1132
    <8b7>   DW_AT_decl_column : 16
    <8b8>   DW_AT_type        : <0x916>
    <8bc>   DW_AT_data_member_location: 68
 <2><8bd>: Abbrev Number: 20 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0xa19ef): xDummy17
    <8c2>   DW_AT_decl_file   : 10
    <8c3>   DW_AT_decl_line   : 1144
    <8c5>   DW_AT_decl_column : 17
    <8c6>   DW_AT_type        : <0x2cf>
    <8ca>   DW_AT_data_member_location: 76
 <2><8cb>: Abbrev Number: 20 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x1d1ed): ulDummy18
    <8d0>   DW_AT_decl_file   : 10
    <8d1>   DW_AT_decl_line   : 1147
    <8d3>   DW_AT_decl_column : 14
    <8d4>   DW_AT_type        : <0xbc>
    <8d8>   DW_AT_data_member_location: 172
 <2><8d9>: Abbrev Number: 20 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0xc7565): ucDummy19
    <8de>   DW_AT_decl_file   : 10
    <8df>   DW_AT_decl_line   : 1148
    <8e1>   DW_AT_decl_column : 13
    <8e2>   DW_AT_type        : <0x9a>
    <8e6>   DW_AT_data_member_location: 176
 <2><8e7>: Abbrev Number: 20 (DW_TAG_member)
    <8e8>   DW_AT_name        : (indirect string, offset: 0xb7673): uxDummy20
    <8ec>   DW_AT_decl_file   : 10
    <8ed>   DW_AT_decl_line   : 1151
    <8ef>   DW_AT_decl_column : 13
    <8f0>   DW_AT_type        : <0x9a>
    <8f4>   DW_AT_data_member_location: 177
 <2><8f5>: Abbrev Number: 0
 <1><8f6>: Abbrev Number: 11 (DW_TAG_array_type)
    <8f7>   DW_AT_type        : <0x84e>
    <8fb>   DW_AT_sibling     : <0x906>
 <2><8ff>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <900>   DW_AT_type        : <0x30>
    <904>   DW_AT_upper_bound : 1
 <2><905>: Abbrev Number: 0
 <1><906>: Abbrev Number: 11 (DW_TAG_array_type)
    <907>   DW_AT_type        : <0x9a>
    <90b>   DW_AT_sibling     : <0x916>
 <2><90f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <910>   DW_AT_type        : <0x30>
    <914>   DW_AT_upper_bound : 15
 <2><915>: Abbrev Number: 0
 <1><916>: Abbrev Number: 11 (DW_TAG_array_type)
    <917>   DW_AT_type        : <0xe0>
    <91b>   DW_AT_sibling     : <0x926>
 <2><91f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <920>   DW_AT_type        : <0x30>
    <924>   DW_AT_upper_bound : 1
 <2><925>: Abbrev Number: 0
 <1><926>: Abbrev Number: 8 (DW_TAG_typedef)
    <927>   DW_AT_name        : (indirect string, offset: 0x642c2): StaticTask_t
    <92b>   DW_AT_decl_file   : 10
    <92c>   DW_AT_decl_line   : 1160
    <92e>   DW_AT_decl_column : 3
    <92f>   DW_AT_type        : <0x85b>
 <1><933>: Abbrev Number: 4 (DW_TAG_typedef)
    <934>   DW_AT_name        : (indirect string, offset: 0xb04df): TaskHandle_t
    <938>   DW_AT_decl_file   : 11
    <939>   DW_AT_decl_line   : 70
    <93a>   DW_AT_decl_column : 37
    <93b>   DW_AT_type        : <0x93f>
 <1><93f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <940>   DW_AT_byte_size   : 4
    <941>   DW_AT_type        : <0x945>
 <1><945>: Abbrev Number: 16 (DW_TAG_structure_type)
    <946>   DW_AT_name        : (indirect string, offset: 0xac2e1): tskTaskControlBlock
    <94a>   DW_AT_declaration : 1
 <1><94a>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <94b>   DW_AT_byte_size   : 4
    <94c>   DW_AT_type        : <0xd4>
 <1><950>: Abbrev Number: 25 (DW_TAG_union_type)
    <951>   DW_AT_byte_size   : 4
    <952>   DW_AT_decl_file   : 1
    <953>   DW_AT_decl_line   : 813
    <955>   DW_AT_decl_column : 9
    <956>   DW_AT_sibling     : <0x981>
 <2><95a>: Abbrev Number: 26 (DW_TAG_member)
    <95b>   DW_AT_name        : u8
    <95e>   DW_AT_decl_file   : 1
    <95f>   DW_AT_decl_line   : 815
    <961>   DW_AT_decl_column : 22
    <962>   DW_AT_type        : <0xa6>
 <2><966>: Abbrev Number: 26 (DW_TAG_member)
    <967>   DW_AT_name        : u16
    <96b>   DW_AT_decl_file   : 1
    <96c>   DW_AT_decl_line   : 816
    <96e>   DW_AT_decl_column : 22
    <96f>   DW_AT_type        : <0xb7>
 <2><973>: Abbrev Number: 26 (DW_TAG_member)
    <974>   DW_AT_name        : u32
    <978>   DW_AT_decl_file   : 1
    <979>   DW_AT_decl_line   : 817
    <97b>   DW_AT_decl_column : 22
    <97c>   DW_AT_type        : <0xc8>
 <2><980>: Abbrev Number: 0
 <1><981>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <982>   DW_AT_type        : <0x950>
 <1><986>: Abbrev Number: 27 (DW_TAG_structure_type)
    <987>   DW_AT_byte_size   : 4096
    <989>   DW_AT_decl_file   : 1
    <98a>   DW_AT_decl_line   : 811
    <98c>   DW_AT_decl_column : 9
    <98d>   DW_AT_sibling     : <0xb25>
 <2><991>: Abbrev Number: 20 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x6425e): PORT
    <996>   DW_AT_decl_file   : 1
    <997>   DW_AT_decl_line   : 818
    <999>   DW_AT_decl_column : 6
    <99a>   DW_AT_type        : <0xb35>
    <99e>   DW_AT_data_member_location: 0
 <2><99f>: Abbrev Number: 20 (DW_TAG_member)
    <9a0>   DW_AT_name        : (indirect string, offset: 0xbf4b0): RESERVED0
    <9a4>   DW_AT_decl_file   : 1
    <9a5>   DW_AT_decl_line   : 819
    <9a7>   DW_AT_decl_column : 18
    <9a8>   DW_AT_type        : <0xb3a>
    <9ac>   DW_AT_data_member_location: 128
 <2><9ad>: Abbrev Number: 28 (DW_TAG_member)
    <9ae>   DW_AT_name        : TER
    <9b2>   DW_AT_decl_file   : 1
    <9b3>   DW_AT_decl_line   : 820
    <9b5>   DW_AT_decl_column : 18
    <9b6>   DW_AT_type        : <0xc8>
    <9ba>   DW_AT_data_member_location: 3584
 <2><9bc>: Abbrev Number: 29 (DW_TAG_member)
    <9bd>   DW_AT_name        : (indirect string, offset: 0xbf4ba): RESERVED1
    <9c1>   DW_AT_decl_file   : 1
    <9c2>   DW_AT_decl_line   : 821
    <9c4>   DW_AT_decl_column : 18
    <9c5>   DW_AT_type        : <0xb4b>
    <9c9>   DW_AT_data_member_location: 3588
 <2><9cb>: Abbrev Number: 28 (DW_TAG_member)
    <9cc>   DW_AT_name        : TPR
    <9d0>   DW_AT_decl_file   : 1
    <9d1>   DW_AT_decl_line   : 822
    <9d3>   DW_AT_decl_column : 18
    <9d4>   DW_AT_type        : <0xc8>
    <9d8>   DW_AT_data_member_location: 3648
 <2><9da>: Abbrev Number: 29 (DW_TAG_member)
    <9db>   DW_AT_name        : (indirect string, offset: 0xbf4c4): RESERVED2
    <9df>   DW_AT_decl_file   : 1
    <9e0>   DW_AT_decl_line   : 823
    <9e2>   DW_AT_decl_column : 18
    <9e3>   DW_AT_type        : <0xb4b>
    <9e7>   DW_AT_data_member_location: 3652
 <2><9e9>: Abbrev Number: 28 (DW_TAG_member)
    <9ea>   DW_AT_name        : TCR
    <9ee>   DW_AT_decl_file   : 1
    <9ef>   DW_AT_decl_line   : 824
    <9f1>   DW_AT_decl_column : 18
    <9f2>   DW_AT_type        : <0xc8>
    <9f6>   DW_AT_data_member_location: 3712
 <2><9f8>: Abbrev Number: 29 (DW_TAG_member)
    <9f9>   DW_AT_name        : (indirect string, offset: 0xbf4ce): RESERVED3
    <9fd>   DW_AT_decl_file   : 1
    <9fe>   DW_AT_decl_line   : 825
    <a00>   DW_AT_decl_column : 18
    <a01>   DW_AT_type        : <0xb5b>
    <a05>   DW_AT_data_member_location: 3716
 <2><a07>: Abbrev Number: 28 (DW_TAG_member)
    <a08>   DW_AT_name        : IWR
    <a0c>   DW_AT_decl_file   : 1
    <a0d>   DW_AT_decl_line   : 826
    <a0f>   DW_AT_decl_column : 18
    <a10>   DW_AT_type        : <0xc8>
    <a14>   DW_AT_data_member_location: 3832
 <2><a16>: Abbrev Number: 28 (DW_TAG_member)
    <a17>   DW_AT_name        : IRR
    <a1b>   DW_AT_decl_file   : 1
    <a1c>   DW_AT_decl_line   : 827
    <a1e>   DW_AT_decl_column : 18
    <a1f>   DW_AT_type        : <0xcd>
    <a23>   DW_AT_data_member_location: 3836
 <2><a25>: Abbrev Number: 29 (DW_TAG_member)
    <a26>   DW_AT_name        : (indirect string, offset: 0x79ce5): IMCR
    <a2a>   DW_AT_decl_file   : 1
    <a2b>   DW_AT_decl_line   : 828
    <a2d>   DW_AT_decl_column : 18
    <a2e>   DW_AT_type        : <0xc8>
    <a32>   DW_AT_data_member_location: 3840
 <2><a34>: Abbrev Number: 29 (DW_TAG_member)
    <a35>   DW_AT_name        : (indirect string, offset: 0xbf4d8): RESERVED4
    <a39>   DW_AT_decl_file   : 1
    <a3a>   DW_AT_decl_line   : 829
    <a3c>   DW_AT_decl_column : 18
    <a3d>   DW_AT_type        : <0xb6b>
    <a41>   DW_AT_data_member_location: 3844
 <2><a43>: Abbrev Number: 28 (DW_TAG_member)
    <a44>   DW_AT_name        : LAR
    <a48>   DW_AT_decl_file   : 1
    <a49>   DW_AT_decl_line   : 830
    <a4b>   DW_AT_decl_column : 18
    <a4c>   DW_AT_type        : <0xc8>
    <a50>   DW_AT_data_member_location: 4016
 <2><a52>: Abbrev Number: 28 (DW_TAG_member)
    <a53>   DW_AT_name        : LSR
    <a57>   DW_AT_decl_file   : 1
    <a58>   DW_AT_decl_line   : 831
    <a5a>   DW_AT_decl_column : 18
    <a5b>   DW_AT_type        : <0xcd>
    <a5f>   DW_AT_data_member_location: 4020
 <2><a61>: Abbrev Number: 29 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0xbf4e2): RESERVED5
    <a66>   DW_AT_decl_file   : 1
    <a67>   DW_AT_decl_line   : 832
    <a69>   DW_AT_decl_column : 18
    <a6a>   DW_AT_type        : <0xb7b>
    <a6e>   DW_AT_data_member_location: 4024
 <2><a70>: Abbrev Number: 29 (DW_TAG_member)
    <a71>   DW_AT_name        : (indirect string, offset: 0x51409): PID4
    <a75>   DW_AT_decl_file   : 1
    <a76>   DW_AT_decl_line   : 833
    <a78>   DW_AT_decl_column : 18
    <a79>   DW_AT_type        : <0xcd>
    <a7d>   DW_AT_data_member_location: 4048
 <2><a7f>: Abbrev Number: 29 (DW_TAG_member)
    <a80>   DW_AT_name        : (indirect string, offset: 0xa02bb): PID5
    <a84>   DW_AT_decl_file   : 1
    <a85>   DW_AT_decl_line   : 834
    <a87>   DW_AT_decl_column : 18
    <a88>   DW_AT_type        : <0xcd>
    <a8c>   DW_AT_data_member_location: 4052
 <2><a8e>: Abbrev Number: 29 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x51440): PID6
    <a93>   DW_AT_decl_file   : 1
    <a94>   DW_AT_decl_line   : 835
    <a96>   DW_AT_decl_column : 18
    <a97>   DW_AT_type        : <0xcd>
    <a9b>   DW_AT_data_member_location: 4056
 <2><a9d>: Abbrev Number: 29 (DW_TAG_member)
    <a9e>   DW_AT_name        : (indirect string, offset: 0x51445): PID7
    <aa2>   DW_AT_decl_file   : 1
    <aa3>   DW_AT_decl_line   : 836
    <aa5>   DW_AT_decl_column : 18
    <aa6>   DW_AT_type        : <0xcd>
    <aaa>   DW_AT_data_member_location: 4060
 <2><aac>: Abbrev Number: 29 (DW_TAG_member)
    <aad>   DW_AT_name        : (indirect string, offset: 0xa0254): PID0
    <ab1>   DW_AT_decl_file   : 1
    <ab2>   DW_AT_decl_line   : 837
    <ab4>   DW_AT_decl_column : 18
    <ab5>   DW_AT_type        : <0xcd>
    <ab9>   DW_AT_data_member_location: 4064
 <2><abb>: Abbrev Number: 29 (DW_TAG_member)
    <abc>   DW_AT_name        : (indirect string, offset: 0xa0270): PID1
    <ac0>   DW_AT_decl_file   : 1
    <ac1>   DW_AT_decl_line   : 838
    <ac3>   DW_AT_decl_column : 18
    <ac4>   DW_AT_type        : <0xcd>
    <ac8>   DW_AT_data_member_location: 4068
 <2><aca>: Abbrev Number: 29 (DW_TAG_member)
    <acb>   DW_AT_name        : (indirect string, offset: 0xa028c): PID2
    <acf>   DW_AT_decl_file   : 1
    <ad0>   DW_AT_decl_line   : 839
    <ad2>   DW_AT_decl_column : 18
    <ad3>   DW_AT_type        : <0xcd>
    <ad7>   DW_AT_data_member_location: 4072
 <2><ad9>: Abbrev Number: 29 (DW_TAG_member)
    <ada>   DW_AT_name        : (indirect string, offset: 0x51404): PID3
    <ade>   DW_AT_decl_file   : 1
    <adf>   DW_AT_decl_line   : 840
    <ae1>   DW_AT_decl_column : 18
    <ae2>   DW_AT_type        : <0xcd>
    <ae6>   DW_AT_data_member_location: 4076
 <2><ae8>: Abbrev Number: 29 (DW_TAG_member)
    <ae9>   DW_AT_name        : (indirect string, offset: 0x1cc4): CID0
    <aed>   DW_AT_decl_file   : 1
    <aee>   DW_AT_decl_line   : 841
    <af0>   DW_AT_decl_column : 18
    <af1>   DW_AT_type        : <0xcd>
    <af5>   DW_AT_data_member_location: 4080
 <2><af7>: Abbrev Number: 29 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0x1cc9): CID1
    <afc>   DW_AT_decl_file   : 1
    <afd>   DW_AT_decl_line   : 842
    <aff>   DW_AT_decl_column : 18
    <b00>   DW_AT_type        : <0xcd>
    <b04>   DW_AT_data_member_location: 4084
 <2><b06>: Abbrev Number: 29 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0x1cce): CID2
    <b0b>   DW_AT_decl_file   : 1
    <b0c>   DW_AT_decl_line   : 843
    <b0e>   DW_AT_decl_column : 18
    <b0f>   DW_AT_type        : <0xcd>
    <b13>   DW_AT_data_member_location: 4088
 <2><b15>: Abbrev Number: 29 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0x1cd3): CID3
    <b1a>   DW_AT_decl_file   : 1
    <b1b>   DW_AT_decl_line   : 844
    <b1d>   DW_AT_decl_column : 18
    <b1e>   DW_AT_type        : <0xcd>
    <b22>   DW_AT_data_member_location: 4092
 <2><b24>: Abbrev Number: 0
 <1><b25>: Abbrev Number: 11 (DW_TAG_array_type)
    <b26>   DW_AT_type        : <0x981>
    <b2a>   DW_AT_sibling     : <0xb35>
 <2><b2e>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b2f>   DW_AT_type        : <0x30>
    <b33>   DW_AT_upper_bound : 31
 <2><b34>: Abbrev Number: 0
 <1><b35>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b36>   DW_AT_type        : <0xb25>
 <1><b3a>: Abbrev Number: 11 (DW_TAG_array_type)
    <b3b>   DW_AT_type        : <0xbc>
    <b3f>   DW_AT_sibling     : <0xb4b>
 <2><b43>: Abbrev Number: 30 (DW_TAG_subrange_type)
    <b44>   DW_AT_type        : <0x30>
    <b48>   DW_AT_upper_bound : 863
 <2><b4a>: Abbrev Number: 0
 <1><b4b>: Abbrev Number: 11 (DW_TAG_array_type)
    <b4c>   DW_AT_type        : <0xbc>
    <b50>   DW_AT_sibling     : <0xb5b>
 <2><b54>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b55>   DW_AT_type        : <0x30>
    <b59>   DW_AT_upper_bound : 14
 <2><b5a>: Abbrev Number: 0
 <1><b5b>: Abbrev Number: 11 (DW_TAG_array_type)
    <b5c>   DW_AT_type        : <0xbc>
    <b60>   DW_AT_sibling     : <0xb6b>
 <2><b64>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b65>   DW_AT_type        : <0x30>
    <b69>   DW_AT_upper_bound : 28
 <2><b6a>: Abbrev Number: 0
 <1><b6b>: Abbrev Number: 11 (DW_TAG_array_type)
    <b6c>   DW_AT_type        : <0xbc>
    <b70>   DW_AT_sibling     : <0xb7b>
 <2><b74>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b75>   DW_AT_type        : <0x30>
    <b79>   DW_AT_upper_bound : 42
 <2><b7a>: Abbrev Number: 0
 <1><b7b>: Abbrev Number: 11 (DW_TAG_array_type)
    <b7c>   DW_AT_type        : <0xbc>
    <b80>   DW_AT_sibling     : <0xb8b>
 <2><b84>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b85>   DW_AT_type        : <0x30>
    <b89>   DW_AT_upper_bound : 5
 <2><b8a>: Abbrev Number: 0
 <1><b8b>: Abbrev Number: 8 (DW_TAG_typedef)
    <b8c>   DW_AT_name        : (indirect string, offset: 0xa5c30): ITM_Type
    <b90>   DW_AT_decl_file   : 1
    <b91>   DW_AT_decl_line   : 845
    <b93>   DW_AT_decl_column : 3
    <b94>   DW_AT_type        : <0x986>
 <1><b98>: Abbrev Number: 31 (DW_TAG_structure_type)
    <b99>   DW_AT_byte_size   : 40
    <b9a>   DW_AT_decl_file   : 12
    <b9b>   DW_AT_decl_line   : 526
    <b9d>   DW_AT_decl_column : 9
    <b9e>   DW_AT_sibling     : <0xc21>
 <2><ba2>: Abbrev Number: 20 (DW_TAG_member)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x840e7): MODER
    <ba7>   DW_AT_decl_file   : 12
    <ba8>   DW_AT_decl_line   : 528
    <baa>   DW_AT_decl_column : 17
    <bab>   DW_AT_type        : <0xc8>
    <baf>   DW_AT_data_member_location: 0
 <2><bb0>: Abbrev Number: 20 (DW_TAG_member)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x9cc06): OTYPER
    <bb5>   DW_AT_decl_file   : 12
    <bb6>   DW_AT_decl_line   : 529
    <bb8>   DW_AT_decl_column : 17
    <bb9>   DW_AT_type        : <0xc8>
    <bbd>   DW_AT_data_member_location: 4
 <2><bbe>: Abbrev Number: 20 (DW_TAG_member)
    <bbf>   DW_AT_name        : (indirect string, offset: 0xb0518): OSPEEDR
    <bc3>   DW_AT_decl_file   : 12
    <bc4>   DW_AT_decl_line   : 530
    <bc6>   DW_AT_decl_column : 17
    <bc7>   DW_AT_type        : <0xc8>
    <bcb>   DW_AT_data_member_location: 8
 <2><bcc>: Abbrev Number: 20 (DW_TAG_member)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x90e1b): PUPDR
    <bd1>   DW_AT_decl_file   : 12
    <bd2>   DW_AT_decl_line   : 531
    <bd4>   DW_AT_decl_column : 17
    <bd5>   DW_AT_type        : <0xc8>
    <bd9>   DW_AT_data_member_location: 12
 <2><bda>: Abbrev Number: 21 (DW_TAG_member)
    <bdb>   DW_AT_name        : IDR
    <bdf>   DW_AT_decl_file   : 12
    <be0>   DW_AT_decl_line   : 532
    <be2>   DW_AT_decl_column : 17
    <be3>   DW_AT_type        : <0xc8>
    <be7>   DW_AT_data_member_location: 16
 <2><be8>: Abbrev Number: 21 (DW_TAG_member)
    <be9>   DW_AT_name        : ODR
    <bed>   DW_AT_decl_file   : 12
    <bee>   DW_AT_decl_line   : 533
    <bf0>   DW_AT_decl_column : 17
    <bf1>   DW_AT_type        : <0xc8>
    <bf5>   DW_AT_data_member_location: 20
 <2><bf6>: Abbrev Number: 20 (DW_TAG_member)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x2dfb1): BSRR
    <bfb>   DW_AT_decl_file   : 12
    <bfc>   DW_AT_decl_line   : 534
    <bfe>   DW_AT_decl_column : 17
    <bff>   DW_AT_type        : <0xc8>
    <c03>   DW_AT_data_member_location: 24
 <2><c04>: Abbrev Number: 20 (DW_TAG_member)
    <c05>   DW_AT_name        : (indirect string, offset: 0xada01): LCKR
    <c09>   DW_AT_decl_file   : 12
    <c0a>   DW_AT_decl_line   : 535
    <c0c>   DW_AT_decl_column : 17
    <c0d>   DW_AT_type        : <0xc8>
    <c11>   DW_AT_data_member_location: 28
 <2><c12>: Abbrev Number: 21 (DW_TAG_member)
    <c13>   DW_AT_name        : AFR
    <c17>   DW_AT_decl_file   : 12
    <c18>   DW_AT_decl_line   : 536
    <c1a>   DW_AT_decl_column : 17
    <c1b>   DW_AT_type        : <0xc31>
    <c1f>   DW_AT_data_member_location: 32
 <2><c20>: Abbrev Number: 0
 <1><c21>: Abbrev Number: 11 (DW_TAG_array_type)
    <c22>   DW_AT_type        : <0xc8>
    <c26>   DW_AT_sibling     : <0xc31>
 <2><c2a>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <c2b>   DW_AT_type        : <0x30>
    <c2f>   DW_AT_upper_bound : 1
 <2><c30>: Abbrev Number: 0
 <1><c31>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c32>   DW_AT_type        : <0xc21>
 <1><c36>: Abbrev Number: 8 (DW_TAG_typedef)
    <c37>   DW_AT_name        : (indirect string, offset: 0xc4e9a): GPIO_TypeDef
    <c3b>   DW_AT_decl_file   : 12
    <c3c>   DW_AT_decl_line   : 537
    <c3e>   DW_AT_decl_column : 3
    <c3f>   DW_AT_type        : <0xb98>
 <1><c43>: Abbrev Number: 32 (DW_TAG_enumeration_type)
    <c44>   DW_AT_encoding    : 5	(signed)
    <c45>   DW_AT_byte_size   : 2
    <c46>   DW_AT_type        : <0x5f>
    <c4a>   DW_AT_decl_file   : 13
    <c4b>   DW_AT_decl_line   : 172
    <c4c>   DW_AT_decl_column : 15
    <c4d>   DW_AT_sibling     : <0xc82>
 <2><c51>: Abbrev Number: 33 (DW_TAG_enumerator)
    <c52>   DW_AT_name        : (indirect string, offset: 0xafe37): osPriorityIdle
    <c56>   DW_AT_const_value : -3
 <2><c57>: Abbrev Number: 33 (DW_TAG_enumerator)
    <c58>   DW_AT_name        : (indirect string, offset: 0xbac67): osPriorityLow
    <c5c>   DW_AT_const_value : -2
 <2><c5d>: Abbrev Number: 33 (DW_TAG_enumerator)
    <c5e>   DW_AT_name        : (indirect string, offset: 0xc2e1f): osPriorityBelowNormal
    <c62>   DW_AT_const_value : -1
 <2><c63>: Abbrev Number: 34 (DW_TAG_enumerator)
    <c64>   DW_AT_name        : (indirect string, offset: 0xa5127): osPriorityNormal
    <c68>   DW_AT_const_value : 0
 <2><c69>: Abbrev Number: 34 (DW_TAG_enumerator)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x823f2): osPriorityAboveNormal
    <c6e>   DW_AT_const_value : 1
 <2><c6f>: Abbrev Number: 34 (DW_TAG_enumerator)
    <c70>   DW_AT_name        : (indirect string, offset: 0x27377): osPriorityHigh
    <c74>   DW_AT_const_value : 2
 <2><c75>: Abbrev Number: 34 (DW_TAG_enumerator)
    <c76>   DW_AT_name        : (indirect string, offset: 0xb7e55): osPriorityRealtime
    <c7a>   DW_AT_const_value : 3
 <2><c7b>: Abbrev Number: 34 (DW_TAG_enumerator)
    <c7c>   DW_AT_name        : (indirect string, offset: 0xb35ab): osPriorityError
    <c80>   DW_AT_const_value : 132
 <2><c81>: Abbrev Number: 0
 <1><c82>: Abbrev Number: 4 (DW_TAG_typedef)
    <c83>   DW_AT_name        : (indirect string, offset: 0xd02ef): osPriority
    <c87>   DW_AT_decl_file   : 13
    <c88>   DW_AT_decl_line   : 181
    <c89>   DW_AT_decl_column : 3
    <c8a>   DW_AT_type        : <0xc43>
 <1><c8e>: Abbrev Number: 32 (DW_TAG_enumeration_type)
    <c8f>   DW_AT_encoding    : 7	(unsigned)
    <c90>   DW_AT_byte_size   : 4
    <c91>   DW_AT_type        : <0x30>
    <c95>   DW_AT_decl_file   : 13
    <c96>   DW_AT_decl_line   : 189
    <c97>   DW_AT_decl_column : 15
    <c98>   DW_AT_sibling     : <0xcfa>
 <2><c9c>: Abbrev Number: 34 (DW_TAG_enumerator)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x9bfef): osOK
    <ca1>   DW_AT_const_value : 0
 <2><ca2>: Abbrev Number: 34 (DW_TAG_enumerator)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x94c23): osEventSignal
    <ca7>   DW_AT_const_value : 8
 <2><ca8>: Abbrev Number: 34 (DW_TAG_enumerator)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x13af): osEventMessage
    <cad>   DW_AT_const_value : 16
 <2><cae>: Abbrev Number: 34 (DW_TAG_enumerator)
    <caf>   DW_AT_name        : (indirect string, offset: 0x81ef5): osEventMail
    <cb3>   DW_AT_const_value : 32
 <2><cb4>: Abbrev Number: 34 (DW_TAG_enumerator)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x224e6): osEventTimeout
    <cb9>   DW_AT_const_value : 64
 <2><cba>: Abbrev Number: 34 (DW_TAG_enumerator)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x34db2): osErrorParameter
    <cbf>   DW_AT_const_value : 128
 <2><cc0>: Abbrev Number: 34 (DW_TAG_enumerator)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x848f9): osErrorResource
    <cc5>   DW_AT_const_value : 129
 <2><cc6>: Abbrev Number: 34 (DW_TAG_enumerator)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x8bbf3): osErrorTimeoutResource
    <ccb>   DW_AT_const_value : 193
 <2><ccc>: Abbrev Number: 34 (DW_TAG_enumerator)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x36d57): osErrorISR
    <cd1>   DW_AT_const_value : 130
 <2><cd2>: Abbrev Number: 34 (DW_TAG_enumerator)
    <cd3>   DW_AT_name        : (indirect string, offset: 0x609c2): osErrorISRRecursive
    <cd7>   DW_AT_const_value : 131
 <2><cd8>: Abbrev Number: 34 (DW_TAG_enumerator)
    <cd9>   DW_AT_name        : (indirect string, offset: 0xc1666): osErrorPriority
    <cdd>   DW_AT_const_value : 132
 <2><cde>: Abbrev Number: 34 (DW_TAG_enumerator)
    <cdf>   DW_AT_name        : (indirect string, offset: 0x2320f): osErrorNoMemory
    <ce3>   DW_AT_const_value : 133
 <2><ce4>: Abbrev Number: 34 (DW_TAG_enumerator)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x8c66e): osErrorValue
    <ce9>   DW_AT_const_value : 134
 <2><cea>: Abbrev Number: 34 (DW_TAG_enumerator)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x6bfe5): osErrorOS
    <cef>   DW_AT_const_value : 255
 <2><cf0>: Abbrev Number: 35 (DW_TAG_enumerator)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x41a05): os_status_reserved
    <cf5>   DW_AT_const_value : 0x7fffffff
 <2><cf9>: Abbrev Number: 0
 <1><cfa>: Abbrev Number: 4 (DW_TAG_typedef)
    <cfb>   DW_AT_name        : (indirect string, offset: 0x1fea7): osStatus
    <cff>   DW_AT_decl_file   : 13
    <d00>   DW_AT_decl_line   : 205
    <d01>   DW_AT_decl_column : 3
    <d02>   DW_AT_type        : <0xc8e>
 <1><d06>: Abbrev Number: 4 (DW_TAG_typedef)
    <d07>   DW_AT_name        : (indirect string, offset: 0x638a9): os_pthread
    <d0b>   DW_AT_decl_file   : 13
    <d0c>   DW_AT_decl_line   : 228
    <d0d>   DW_AT_decl_column : 16
    <d0e>   DW_AT_type        : <0xd12>
 <1><d12>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <d13>   DW_AT_byte_size   : 4
    <d14>   DW_AT_type        : <0xd18>
 <1><d18>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <d19>   DW_AT_prototyped  : 1
    <d19>   DW_AT_sibling     : <0xd23>
 <2><d1d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d1e>   DW_AT_type        : <0xd23>
 <2><d22>: Abbrev Number: 0
 <1><d23>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <d24>   DW_AT_byte_size   : 4
    <d25>   DW_AT_type        : <0xd29>
 <1><d29>: Abbrev Number: 36 (DW_TAG_const_type)
 <1><d2a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x24977): osThreadId
    <d2f>   DW_AT_decl_file   : 13
    <d30>   DW_AT_decl_line   : 238
    <d31>   DW_AT_decl_column : 22
    <d32>   DW_AT_type        : <0x933>
 <1><d36>: Abbrev Number: 8 (DW_TAG_typedef)
    <d37>   DW_AT_name        : (indirect string, offset: 0x7ee12): osStaticThreadDef_t
    <d3b>   DW_AT_decl_file   : 13
    <d3c>   DW_AT_decl_line   : 267
    <d3e>   DW_AT_decl_column : 36
    <d3f>   DW_AT_type        : <0x926>
 <1><d43>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d44>   DW_AT_name        : (indirect string, offset: 0x2936b): os_thread_def
    <d48>   DW_AT_byte_size   : 28
    <d49>   DW_AT_decl_file   : 13
    <d4a>   DW_AT_decl_line   : 280
    <d4c>   DW_AT_decl_column : 16
    <d4d>   DW_AT_sibling     : <0xdb4>
 <2><d51>: Abbrev Number: 20 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0xb57d2): name
    <d56>   DW_AT_decl_file   : 13
    <d57>   DW_AT_decl_line   : 281
    <d59>   DW_AT_decl_column : 27
    <d5a>   DW_AT_type        : <0x579>
    <d5e>   DW_AT_data_member_location: 0
 <2><d5f>: Abbrev Number: 20 (DW_TAG_member)
    <d60>   DW_AT_name        : (indirect string, offset: 0x638ac): pthread
    <d64>   DW_AT_decl_file   : 13
    <d65>   DW_AT_decl_line   : 282
    <d67>   DW_AT_decl_column : 26
    <d68>   DW_AT_type        : <0xd06>
    <d6c>   DW_AT_data_member_location: 4
 <2><d6d>: Abbrev Number: 20 (DW_TAG_member)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x92d12): tpriority
    <d72>   DW_AT_decl_file   : 13
    <d73>   DW_AT_decl_line   : 283
    <d75>   DW_AT_decl_column : 26
    <d76>   DW_AT_type        : <0xc82>
    <d7a>   DW_AT_data_member_location: 8
 <2><d7b>: Abbrev Number: 20 (DW_TAG_member)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x5447f): instances
    <d80>   DW_AT_decl_file   : 13
    <d81>   DW_AT_decl_line   : 284
    <d83>   DW_AT_decl_column : 26
    <d84>   DW_AT_type        : <0xbc>
    <d88>   DW_AT_data_member_location: 12
 <2><d89>: Abbrev Number: 20 (DW_TAG_member)
    <d8a>   DW_AT_name        : (indirect string, offset: 0xfbfc): stacksize
    <d8e>   DW_AT_decl_file   : 13
    <d8f>   DW_AT_decl_line   : 285
    <d91>   DW_AT_decl_column : 26
    <d92>   DW_AT_type        : <0xbc>
    <d96>   DW_AT_data_member_location: 16
 <2><d97>: Abbrev Number: 20 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0x1eae9): buffer
    <d9c>   DW_AT_decl_file   : 13
    <d9d>   DW_AT_decl_line   : 287
    <d9f>   DW_AT_decl_column : 27
    <da0>   DW_AT_type        : <0xdb4>
    <da4>   DW_AT_data_member_location: 20
 <2><da5>: Abbrev Number: 20 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0x5c125): controlblock
    <daa>   DW_AT_decl_file   : 13
    <dab>   DW_AT_decl_line   : 288
    <dad>   DW_AT_decl_column : 27
    <dae>   DW_AT_type        : <0xdba>
    <db2>   DW_AT_data_member_location: 24
 <2><db3>: Abbrev Number: 0
 <1><db4>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <db5>   DW_AT_byte_size   : 4
    <db6>   DW_AT_type        : <0xbc>
 <1><dba>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <dbb>   DW_AT_byte_size   : 4
    <dbc>   DW_AT_type        : <0xd36>
 <1><dc0>: Abbrev Number: 8 (DW_TAG_typedef)
    <dc1>   DW_AT_name        : (indirect string, offset: 0xf547): osThreadDef_t
    <dc5>   DW_AT_decl_file   : 13
    <dc6>   DW_AT_decl_line   : 290
    <dc8>   DW_AT_decl_column : 3
    <dc9>   DW_AT_type        : <0xd43>
 <1><dcd>: Abbrev Number: 6 (DW_TAG_const_type)
    <dce>   DW_AT_type        : <0xdc0>
 <1><dd2>: Abbrev Number: 37 (DW_TAG_variable)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x50ce7): defaultTaskHandle
    <dd7>   DW_AT_decl_file   : 2
    <dd8>   DW_AT_decl_line   : 50
    <dd9>   DW_AT_decl_column : 12
    <dda>   DW_AT_type        : <0xd2a>
    <dde>   DW_AT_external    : 1
    <dde>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><de4>: Abbrev Number: 37 (DW_TAG_variable)
    <de5>   DW_AT_name        : (indirect string, offset: 0xb7591): Led1Handle
    <de9>   DW_AT_decl_file   : 2
    <dea>   DW_AT_decl_line   : 51
    <deb>   DW_AT_decl_column : 12
    <dec>   DW_AT_type        : <0xd2a>
    <df0>   DW_AT_external    : 1
    <df0>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><df6>: Abbrev Number: 37 (DW_TAG_variable)
    <df7>   DW_AT_name        : (indirect string, offset: 0x36bf2): led2Handle
    <dfb>   DW_AT_decl_file   : 2
    <dfc>   DW_AT_decl_line   : 52
    <dfd>   DW_AT_decl_column : 12
    <dfe>   DW_AT_type        : <0xd2a>
    <e02>   DW_AT_external    : 1
    <e02>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><e08>: Abbrev Number: 38 (DW_TAG_variable)
    <e09>   DW_AT_name        : (indirect string, offset: 0x6b054): xIdleTaskTCBBuffer
    <e0d>   DW_AT_decl_file   : 2
    <e0e>   DW_AT_decl_line   : 69
    <e0f>   DW_AT_decl_column : 21
    <e10>   DW_AT_type        : <0x926>
    <e14>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><e1a>: Abbrev Number: 11 (DW_TAG_array_type)
    <e1b>   DW_AT_type        : <0xd4>
    <e1f>   DW_AT_sibling     : <0xe2a>
 <2><e23>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <e24>   DW_AT_type        : <0x30>
    <e28>   DW_AT_upper_bound : 127
 <2><e29>: Abbrev Number: 0
 <1><e2a>: Abbrev Number: 38 (DW_TAG_variable)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x3d935): xIdleStack
    <e2f>   DW_AT_decl_file   : 2
    <e30>   DW_AT_decl_line   : 70
    <e31>   DW_AT_decl_column : 20
    <e32>   DW_AT_type        : <0xe1a>
    <e36>   DW_AT_location    : 5 byte block: 3 50 1 0 20 	(DW_OP_addr: 20000150)
 <1><e3c>: Abbrev Number: 39 (DW_TAG_subprogram)
    <e3d>   DW_AT_external    : 1
    <e3d>   DW_AT_name        : (indirect string, offset: 0x3de5f): HAL_GPIO_TogglePin
    <e41>   DW_AT_decl_file   : 14
    <e42>   DW_AT_decl_line   : 236
    <e43>   DW_AT_decl_column : 6
    <e44>   DW_AT_prototyped  : 1
    <e44>   DW_AT_declaration : 1
    <e44>   DW_AT_sibling     : <0xe53>
 <2><e48>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e49>   DW_AT_type        : <0xe53>
 <2><e4d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e4e>   DW_AT_type        : <0xab>
 <2><e52>: Abbrev Number: 0
 <1><e53>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <e54>   DW_AT_byte_size   : 4
    <e55>   DW_AT_type        : <0xc36>
 <1><e59>: Abbrev Number: 40 (DW_TAG_subprogram)
    <e5a>   DW_AT_external    : 1
    <e5a>   DW_AT_name        : (indirect string, offset: 0xb7b4a): osDelay
    <e5e>   DW_AT_decl_file   : 13
    <e5f>   DW_AT_decl_line   : 478
    <e61>   DW_AT_decl_column : 10
    <e62>   DW_AT_prototyped  : 1
    <e62>   DW_AT_type        : <0xcfa>
    <e66>   DW_AT_declaration : 1
    <e66>   DW_AT_sibling     : <0xe70>
 <2><e6a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e6b>   DW_AT_type        : <0xbc>
 <2><e6f>: Abbrev Number: 0
 <1><e70>: Abbrev Number: 40 (DW_TAG_subprogram)
    <e71>   DW_AT_external    : 1
    <e71>   DW_AT_name        : (indirect string, offset: 0x4d070): osThreadCreate
    <e75>   DW_AT_decl_file   : 13
    <e76>   DW_AT_decl_line   : 441
    <e78>   DW_AT_decl_column : 12
    <e79>   DW_AT_prototyped  : 1
    <e79>   DW_AT_type        : <0xd2a>
    <e7d>   DW_AT_declaration : 1
    <e7d>   DW_AT_sibling     : <0xe8c>
 <2><e81>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e82>   DW_AT_type        : <0xe8c>
 <2><e86>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e87>   DW_AT_type        : <0xd2>
 <2><e8b>: Abbrev Number: 0
 <1><e8c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <e8d>   DW_AT_byte_size   : 4
    <e8e>   DW_AT_type        : <0xdcd>
 <1><e92>: Abbrev Number: 41 (DW_TAG_subprogram)
    <e93>   DW_AT_external    : 1
    <e93>   DW_AT_name        : (indirect string, offset: 0x625e): __io_putchar
    <e97>   DW_AT_decl_file   : 2
    <e98>   DW_AT_decl_line   : 186
    <e99>   DW_AT_decl_column : 5
    <e9a>   DW_AT_prototyped  : 1
    <e9a>   DW_AT_type        : <0x29>
    <e9e>   DW_AT_low_pc      : 0x8000654
    <ea2>   DW_AT_high_pc     : 0x1a
    <ea6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ea8>   DW_AT_GNU_all_tail_call_sites: 1
    <ea8>   DW_AT_sibling     : <0xebb>
 <2><eac>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <ead>   DW_AT_name        : ch
    <eb0>   DW_AT_decl_file   : 2
    <eb1>   DW_AT_decl_line   : 186
    <eb2>   DW_AT_decl_column : 22
    <eb3>   DW_AT_type        : <0x29>
    <eb7>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><eba>: Abbrev Number: 0
 <1><ebb>: Abbrev Number: 43 (DW_TAG_subprogram)
    <ebc>   DW_AT_external    : 1
    <ebc>   DW_AT_name        : (indirect string, offset: 0x61583): task_led2
    <ec0>   DW_AT_decl_file   : 2
    <ec1>   DW_AT_decl_line   : 171
    <ec2>   DW_AT_decl_column : 6
    <ec3>   DW_AT_prototyped  : 1
    <ec3>   DW_AT_low_pc      : 0x8000628
    <ec7>   DW_AT_high_pc     : 0x2c
    <ecb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ecd>   DW_AT_GNU_all_tail_call_sites: 1
    <ecd>   DW_AT_sibling     : <0xee1>
 <2><ed1>: Abbrev Number: 44 (DW_TAG_formal_parameter)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x2bbfc): argument
    <ed6>   DW_AT_decl_file   : 2
    <ed7>   DW_AT_decl_line   : 171
    <ed8>   DW_AT_decl_column : 29
    <ed9>   DW_AT_type        : <0xd23>
    <edd>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ee0>: Abbrev Number: 0
 <1><ee1>: Abbrev Number: 43 (DW_TAG_subprogram)
    <ee2>   DW_AT_external    : 1
    <ee2>   DW_AT_name        : (indirect string, offset: 0xaf73a): task_led1
    <ee6>   DW_AT_decl_file   : 2
    <ee7>   DW_AT_decl_line   : 151
    <ee8>   DW_AT_decl_column : 6
    <ee9>   DW_AT_prototyped  : 1
    <ee9>   DW_AT_low_pc      : 0x80005fc
    <eed>   DW_AT_high_pc     : 0x2c
    <ef1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ef3>   DW_AT_GNU_all_tail_call_sites: 1
    <ef3>   DW_AT_sibling     : <0xf07>
 <2><ef7>: Abbrev Number: 44 (DW_TAG_formal_parameter)
    <ef8>   DW_AT_name        : (indirect string, offset: 0x2bbfc): argument
    <efc>   DW_AT_decl_file   : 2
    <efd>   DW_AT_decl_line   : 151
    <efe>   DW_AT_decl_column : 29
    <eff>   DW_AT_type        : <0xd23>
    <f03>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f06>: Abbrev Number: 0
 <1><f07>: Abbrev Number: 43 (DW_TAG_subprogram)
    <f08>   DW_AT_external    : 1
    <f08>   DW_AT_name        : (indirect string, offset: 0x2d5df): StartDefaultTask
    <f0c>   DW_AT_decl_file   : 2
    <f0d>   DW_AT_decl_line   : 133
    <f0e>   DW_AT_decl_column : 6
    <f0f>   DW_AT_prototyped  : 1
    <f0f>   DW_AT_low_pc      : 0x80005ec
    <f13>   DW_AT_high_pc     : 0x10
    <f17>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f19>   DW_AT_GNU_all_tail_call_sites: 1
    <f19>   DW_AT_sibling     : <0xf2d>
 <2><f1d>: Abbrev Number: 44 (DW_TAG_formal_parameter)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x2bbfc): argument
    <f22>   DW_AT_decl_file   : 2
    <f23>   DW_AT_decl_line   : 133
    <f24>   DW_AT_decl_column : 36
    <f25>   DW_AT_type        : <0xd23>
    <f29>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f2c>: Abbrev Number: 0
 <1><f2d>: Abbrev Number: 43 (DW_TAG_subprogram)
    <f2e>   DW_AT_external    : 1
    <f2e>   DW_AT_name        : (indirect string, offset: 0xa3078): MX_FREERTOS_Init
    <f32>   DW_AT_decl_file   : 2
    <f33>   DW_AT_decl_line   : 86
    <f34>   DW_AT_decl_column : 6
    <f35>   DW_AT_prototyped  : 1
    <f35>   DW_AT_low_pc      : 0x8000558
    <f39>   DW_AT_high_pc     : 0x94
    <f3d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f3f>   DW_AT_GNU_all_tail_call_sites: 1
    <f3f>   DW_AT_sibling     : <0xf73>
 <2><f43>: Abbrev Number: 38 (DW_TAG_variable)
    <f44>   DW_AT_name        : (indirect string, offset: 0x98a87): os_thread_def_defaultTask
    <f48>   DW_AT_decl_file   : 2
    <f49>   DW_AT_decl_line   : 109
    <f4a>   DW_AT_decl_column : 3
    <f4b>   DW_AT_type        : <0xdcd>
    <f4f>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><f52>: Abbrev Number: 38 (DW_TAG_variable)
    <f53>   DW_AT_name        : (indirect string, offset: 0xc879c): os_thread_def_Led1
    <f57>   DW_AT_decl_file   : 2
    <f58>   DW_AT_decl_line   : 113
    <f59>   DW_AT_decl_column : 3
    <f5a>   DW_AT_type        : <0xdcd>
    <f5e>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><f62>: Abbrev Number: 38 (DW_TAG_variable)
    <f63>   DW_AT_name        : (indirect string, offset: 0xb0b3f): os_thread_def_led2
    <f67>   DW_AT_decl_file   : 2
    <f68>   DW_AT_decl_line   : 117
    <f69>   DW_AT_decl_column : 3
    <f6a>   DW_AT_type        : <0xdcd>
    <f6e>   DW_AT_location    : 3 byte block: 91 9c 7f 	(DW_OP_fbreg: -100)
 <2><f72>: Abbrev Number: 0
 <1><f73>: Abbrev Number: 45 (DW_TAG_subprogram)
    <f74>   DW_AT_external    : 1
    <f74>   DW_AT_name        : (indirect string, offset: 0x91702): vApplicationGetIdleTaskMemory
    <f78>   DW_AT_decl_file   : 2
    <f79>   DW_AT_decl_line   : 72
    <f7a>   DW_AT_decl_column : 6
    <f7b>   DW_AT_prototyped  : 1
    <f7b>   DW_AT_low_pc      : 0x8000524
    <f7f>   DW_AT_high_pc     : 0x34
    <f83>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f85>   DW_AT_GNU_all_call_sites: 1
    <f85>   DW_AT_sibling     : <0xfb7>
 <2><f89>: Abbrev Number: 44 (DW_TAG_formal_parameter)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x6b052): ppxIdleTaskTCBBuffer
    <f8e>   DW_AT_decl_file   : 2
    <f8f>   DW_AT_decl_line   : 72
    <f90>   DW_AT_decl_column : 52
    <f91>   DW_AT_type        : <0xfb7>
    <f95>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f98>: Abbrev Number: 44 (DW_TAG_formal_parameter)
    <f99>   DW_AT_name        : (indirect string, offset: 0x75794): ppxIdleTaskStackBuffer
    <f9d>   DW_AT_decl_file   : 2
    <f9e>   DW_AT_decl_line   : 72
    <f9f>   DW_AT_decl_column : 88
    <fa0>   DW_AT_type        : <0xfc3>
    <fa4>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><fa7>: Abbrev Number: 44 (DW_TAG_formal_parameter)
    <fa8>   DW_AT_name        : (indirect string, offset: 0x6f247): pulIdleTaskStackSize
    <fac>   DW_AT_decl_file   : 2
    <fad>   DW_AT_decl_line   : 72
    <fae>   DW_AT_decl_column : 122
    <faf>   DW_AT_type        : <0xdb4>
    <fb3>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><fb6>: Abbrev Number: 0
 <1><fb7>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <fb8>   DW_AT_byte_size   : 4
    <fb9>   DW_AT_type        : <0xfbd>
 <1><fbd>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <fbe>   DW_AT_byte_size   : 4
    <fbf>   DW_AT_type        : <0x926>
 <1><fc3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <fc4>   DW_AT_byte_size   : 4
    <fc5>   DW_AT_type        : <0x94a>
 <1><fc9>: Abbrev Number: 46 (DW_TAG_subprogram)
    <fca>   DW_AT_name        : (indirect string, offset: 0xa3ed0): ITM_SendChar
    <fce>   DW_AT_decl_file   : 1
    <fcf>   DW_AT_decl_line   : 2064
    <fd1>   DW_AT_decl_column : 26
    <fd2>   DW_AT_prototyped  : 1
    <fd2>   DW_AT_type        : <0xbc>
    <fd6>   DW_AT_low_pc      : 0x80004d4
    <fda>   DW_AT_high_pc     : 0x4e
    <fde>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fe0>   DW_AT_GNU_all_call_sites: 1
 <2><fe0>: Abbrev Number: 47 (DW_TAG_formal_parameter)
    <fe1>   DW_AT_name        : ch
    <fe4>   DW_AT_decl_file   : 1
    <fe5>   DW_AT_decl_line   : 2064
    <fe7>   DW_AT_decl_column : 49
    <fe8>   DW_AT_type        : <0xbc>
    <fec>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fef>: Abbrev Number: 0
 <1><ff0>: Abbrev Number: 0
  Compilation Unit @ offset 0xff1:
   Length:        0x416 (32-bit)
   Version:       4
   Abbrev Offset: 0x2bf
   Pointer Size:  4
 <0><ffc>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <ffd>   DW_AT_producer    : (indirect string, offset: 0xa73e6): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <1001>   DW_AT_language    : 12	(ANSI C99)
    <1002>   DW_AT_name        : (indirect string, offset: 0xcbbd0): ../Core/Src/gpio.c
    <1006>   DW_AT_comp_dir    : (indirect string, offset: 0x8cbf1): D:/TRABAJO/UMAKER/CURSOS/ARM - NUCLEO/STM32_FromScratch/MARZO-2023/FreeRTOS/Debug
    <100a>   DW_AT_ranges      : 0x40
    <100e>   DW_AT_low_pc      : 0x0
    <1012>   DW_AT_stmt_list   : 0xb27
    <1016>   DW_AT_GNU_macros  : 0x20386
 <1><101a>: Abbrev Number: 2 (DW_TAG_base_type)
    <101b>   DW_AT_byte_size   : 1
    <101c>   DW_AT_encoding    : 6	(signed char)
    <101d>   DW_AT_name        : (indirect string, offset: 0x659a9): signed char
 <1><1021>: Abbrev Number: 2 (DW_TAG_base_type)
    <1022>   DW_AT_byte_size   : 1
    <1023>   DW_AT_encoding    : 8	(unsigned char)
    <1024>   DW_AT_name        : (indirect string, offset: 0xc3c99): unsigned char
 <1><1028>: Abbrev Number: 2 (DW_TAG_base_type)
    <1029>   DW_AT_byte_size   : 2
    <102a>   DW_AT_encoding    : 5	(signed)
    <102b>   DW_AT_name        : (indirect string, offset: 0x96ff2): short int
 <1><102f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1030>   DW_AT_name        : (indirect string, offset: 0xa57d8): __uint16_t
    <1034>   DW_AT_decl_file   : 2
    <1035>   DW_AT_decl_line   : 57
    <1036>   DW_AT_decl_column : 25
    <1037>   DW_AT_type        : <0x103b>
 <1><103b>: Abbrev Number: 2 (DW_TAG_base_type)
    <103c>   DW_AT_byte_size   : 2
    <103d>   DW_AT_encoding    : 7	(unsigned)
    <103e>   DW_AT_name        : (indirect string, offset: 0xc244e): short unsigned int
 <1><1042>: Abbrev Number: 2 (DW_TAG_base_type)
    <1043>   DW_AT_byte_size   : 4
    <1044>   DW_AT_encoding    : 5	(signed)
    <1045>   DW_AT_name        : (indirect string, offset: 0x10f4e): long int
 <1><1049>: Abbrev Number: 3 (DW_TAG_typedef)
    <104a>   DW_AT_name        : (indirect string, offset: 0x8162b): __uint32_t
    <104e>   DW_AT_decl_file   : 2
    <104f>   DW_AT_decl_line   : 79
    <1050>   DW_AT_decl_column : 25
    <1051>   DW_AT_type        : <0x1055>
 <1><1055>: Abbrev Number: 2 (DW_TAG_base_type)
    <1056>   DW_AT_byte_size   : 4
    <1057>   DW_AT_encoding    : 7	(unsigned)
    <1058>   DW_AT_name        : (indirect string, offset: 0x4db19): long unsigned int
 <1><105c>: Abbrev Number: 2 (DW_TAG_base_type)
    <105d>   DW_AT_byte_size   : 8
    <105e>   DW_AT_encoding    : 5	(signed)
    <105f>   DW_AT_name        : (indirect string, offset: 0x5caa3): long long int
 <1><1063>: Abbrev Number: 2 (DW_TAG_base_type)
    <1064>   DW_AT_byte_size   : 8
    <1065>   DW_AT_encoding    : 7	(unsigned)
    <1066>   DW_AT_name        : (indirect string, offset: 0x2a624): long long unsigned int
 <1><106a>: Abbrev Number: 4 (DW_TAG_base_type)
    <106b>   DW_AT_byte_size   : 4
    <106c>   DW_AT_encoding    : 5	(signed)
    <106d>   DW_AT_name        : int
 <1><1071>: Abbrev Number: 2 (DW_TAG_base_type)
    <1072>   DW_AT_byte_size   : 4
    <1073>   DW_AT_encoding    : 7	(unsigned)
    <1074>   DW_AT_name        : (indirect string, offset: 0x10621): unsigned int
 <1><1078>: Abbrev Number: 3 (DW_TAG_typedef)
    <1079>   DW_AT_name        : (indirect string, offset: 0x93e24): uint16_t
    <107d>   DW_AT_decl_file   : 3
    <107e>   DW_AT_decl_line   : 36
    <107f>   DW_AT_decl_column : 20
    <1080>   DW_AT_type        : <0x102f>
 <1><1084>: Abbrev Number: 3 (DW_TAG_typedef)
    <1085>   DW_AT_name        : (indirect string, offset: 0x9344e): uint32_t
    <1089>   DW_AT_decl_file   : 3
    <108a>   DW_AT_decl_line   : 48
    <108b>   DW_AT_decl_column : 20
    <108c>   DW_AT_type        : <0x1049>
 <1><1090>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1091>   DW_AT_type        : <0x1084>
 <1><1095>: Abbrev Number: 6 (DW_TAG_array_type)
    <1096>   DW_AT_type        : <0x1084>
    <109a>   DW_AT_sibling     : <0x10a5>
 <2><109e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <109f>   DW_AT_type        : <0x1071>
    <10a3>   DW_AT_upper_bound : 1
 <2><10a4>: Abbrev Number: 0
 <1><10a5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <10a6>   DW_AT_byte_size   : 40
    <10a7>   DW_AT_decl_file   : 4
    <10a8>   DW_AT_decl_line   : 526
    <10aa>   DW_AT_decl_column : 9
    <10ab>   DW_AT_sibling     : <0x112e>
 <2><10af>: Abbrev Number: 9 (DW_TAG_member)
    <10b0>   DW_AT_name        : (indirect string, offset: 0x840e7): MODER
    <10b4>   DW_AT_decl_file   : 4
    <10b5>   DW_AT_decl_line   : 528
    <10b7>   DW_AT_decl_column : 17
    <10b8>   DW_AT_type        : <0x1090>
    <10bc>   DW_AT_data_member_location: 0
 <2><10bd>: Abbrev Number: 9 (DW_TAG_member)
    <10be>   DW_AT_name        : (indirect string, offset: 0x9cc06): OTYPER
    <10c2>   DW_AT_decl_file   : 4
    <10c3>   DW_AT_decl_line   : 529
    <10c5>   DW_AT_decl_column : 17
    <10c6>   DW_AT_type        : <0x1090>
    <10ca>   DW_AT_data_member_location: 4
 <2><10cb>: Abbrev Number: 9 (DW_TAG_member)
    <10cc>   DW_AT_name        : (indirect string, offset: 0xb0518): OSPEEDR
    <10d0>   DW_AT_decl_file   : 4
    <10d1>   DW_AT_decl_line   : 530
    <10d3>   DW_AT_decl_column : 17
    <10d4>   DW_AT_type        : <0x1090>
    <10d8>   DW_AT_data_member_location: 8
 <2><10d9>: Abbrev Number: 9 (DW_TAG_member)
    <10da>   DW_AT_name        : (indirect string, offset: 0x90e1b): PUPDR
    <10de>   DW_AT_decl_file   : 4
    <10df>   DW_AT_decl_line   : 531
    <10e1>   DW_AT_decl_column : 17
    <10e2>   DW_AT_type        : <0x1090>
    <10e6>   DW_AT_data_member_location: 12
 <2><10e7>: Abbrev Number: 10 (DW_TAG_member)
    <10e8>   DW_AT_name        : IDR
    <10ec>   DW_AT_decl_file   : 4
    <10ed>   DW_AT_decl_line   : 532
    <10ef>   DW_AT_decl_column : 17
    <10f0>   DW_AT_type        : <0x1090>
    <10f4>   DW_AT_data_member_location: 16
 <2><10f5>: Abbrev Number: 10 (DW_TAG_member)
    <10f6>   DW_AT_name        : ODR
    <10fa>   DW_AT_decl_file   : 4
    <10fb>   DW_AT_decl_line   : 533
    <10fd>   DW_AT_decl_column : 17
    <10fe>   DW_AT_type        : <0x1090>
    <1102>   DW_AT_data_member_location: 20
 <2><1103>: Abbrev Number: 9 (DW_TAG_member)
    <1104>   DW_AT_name        : (indirect string, offset: 0x2dfb1): BSRR
    <1108>   DW_AT_decl_file   : 4
    <1109>   DW_AT_decl_line   : 534
    <110b>   DW_AT_decl_column : 17
    <110c>   DW_AT_type        : <0x1090>
    <1110>   DW_AT_data_member_location: 24
 <2><1111>: Abbrev Number: 9 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0xada01): LCKR
    <1116>   DW_AT_decl_file   : 4
    <1117>   DW_AT_decl_line   : 535
    <1119>   DW_AT_decl_column : 17
    <111a>   DW_AT_type        : <0x1090>
    <111e>   DW_AT_data_member_location: 28
 <2><111f>: Abbrev Number: 10 (DW_TAG_member)
    <1120>   DW_AT_name        : AFR
    <1124>   DW_AT_decl_file   : 4
    <1125>   DW_AT_decl_line   : 536
    <1127>   DW_AT_decl_column : 17
    <1128>   DW_AT_type        : <0x113e>
    <112c>   DW_AT_data_member_location: 32
 <2><112d>: Abbrev Number: 0
 <1><112e>: Abbrev Number: 6 (DW_TAG_array_type)
    <112f>   DW_AT_type        : <0x1090>
    <1133>   DW_AT_sibling     : <0x113e>
 <2><1137>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1138>   DW_AT_type        : <0x1071>
    <113c>   DW_AT_upper_bound : 1
 <2><113d>: Abbrev Number: 0
 <1><113e>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <113f>   DW_AT_type        : <0x112e>
 <1><1143>: Abbrev Number: 11 (DW_TAG_typedef)
    <1144>   DW_AT_name        : (indirect string, offset: 0xc4e9a): GPIO_TypeDef
    <1148>   DW_AT_decl_file   : 4
    <1149>   DW_AT_decl_line   : 537
    <114b>   DW_AT_decl_column : 3
    <114c>   DW_AT_type        : <0x10a5>
 <1><1150>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1151>   DW_AT_byte_size   : 136
    <1152>   DW_AT_decl_file   : 4
    <1153>   DW_AT_decl_line   : 596
    <1155>   DW_AT_decl_column : 9
    <1156>   DW_AT_sibling     : <0x12fe>
 <2><115a>: Abbrev Number: 10 (DW_TAG_member)
    <115b>   DW_AT_name        : CR
    <115e>   DW_AT_decl_file   : 4
    <115f>   DW_AT_decl_line   : 598
    <1161>   DW_AT_decl_column : 17
    <1162>   DW_AT_type        : <0x1090>
    <1166>   DW_AT_data_member_location: 0
 <2><1167>: Abbrev Number: 9 (DW_TAG_member)
    <1168>   DW_AT_name        : (indirect string, offset: 0xcbc91): PLLCFGR
    <116c>   DW_AT_decl_file   : 4
    <116d>   DW_AT_decl_line   : 599
    <116f>   DW_AT_decl_column : 17
    <1170>   DW_AT_type        : <0x1090>
    <1174>   DW_AT_data_member_location: 4
 <2><1175>: Abbrev Number: 9 (DW_TAG_member)
    <1176>   DW_AT_name        : (indirect string, offset: 0xcbc94): CFGR
    <117a>   DW_AT_decl_file   : 4
    <117b>   DW_AT_decl_line   : 600
    <117d>   DW_AT_decl_column : 17
    <117e>   DW_AT_type        : <0x1090>
    <1182>   DW_AT_data_member_location: 8
 <2><1183>: Abbrev Number: 10 (DW_TAG_member)
    <1184>   DW_AT_name        : CIR
    <1188>   DW_AT_decl_file   : 4
    <1189>   DW_AT_decl_line   : 601
    <118b>   DW_AT_decl_column : 17
    <118c>   DW_AT_type        : <0x1090>
    <1190>   DW_AT_data_member_location: 12
 <2><1191>: Abbrev Number: 9 (DW_TAG_member)
    <1192>   DW_AT_name        : (indirect string, offset: 0xcbcaa): AHB1RSTR
    <1196>   DW_AT_decl_file   : 4
    <1197>   DW_AT_decl_line   : 602
    <1199>   DW_AT_decl_column : 17
    <119a>   DW_AT_type        : <0x1090>
    <119e>   DW_AT_data_member_location: 16
 <2><119f>: Abbrev Number: 9 (DW_TAG_member)
    <11a0>   DW_AT_name        : (indirect string, offset: 0xcbb9b): AHB2RSTR
    <11a4>   DW_AT_decl_file   : 4
    <11a5>   DW_AT_decl_line   : 603
    <11a7>   DW_AT_decl_column : 17
    <11a8>   DW_AT_type        : <0x1090>
    <11ac>   DW_AT_data_member_location: 20
 <2><11ad>: Abbrev Number: 9 (DW_TAG_member)
    <11ae>   DW_AT_name        : (indirect string, offset: 0xcbc0e): AHB3RSTR
    <11b2>   DW_AT_decl_file   : 4
    <11b3>   DW_AT_decl_line   : 604
    <11b5>   DW_AT_decl_column : 17
    <11b6>   DW_AT_type        : <0x1090>
    <11ba>   DW_AT_data_member_location: 24
 <2><11bb>: Abbrev Number: 9 (DW_TAG_member)
    <11bc>   DW_AT_name        : (indirect string, offset: 0xbf4b0): RESERVED0
    <11c0>   DW_AT_decl_file   : 4
    <11c1>   DW_AT_decl_line   : 605
    <11c3>   DW_AT_decl_column : 17
    <11c4>   DW_AT_type        : <0x1084>
    <11c8>   DW_AT_data_member_location: 28
 <2><11c9>: Abbrev Number: 9 (DW_TAG_member)
    <11ca>   DW_AT_name        : (indirect string, offset: 0xcbb92): APB1RSTR
    <11ce>   DW_AT_decl_file   : 4
    <11cf>   DW_AT_decl_line   : 606
    <11d1>   DW_AT_decl_column : 17
